{"/":{"title":"Introduction","data":{"présentation-de-platon#Présentation de PLaTon":"PLaTon est un projet universitaire open source conçu pour enrichir l'expérience pédagogique des enseignants et des apprenants.\nLa plateforme ne se limite pas à la création d'exercices, elle ambitionne également de fournir des conseils, de monitorer les apprentissages et d'assister à la cohérence des activités pédagogiques.\nPLaTon se positionne comme un outil d'apprentissage polyvalent, à la fois pour les enseignants, dans leur rôle de planificateurs et rédacteurs d'activités pédagogiques, et pour les apprenants.","objectif-et-vision#Objectif et vision":"PLaTon est né de la nécessité d'un outil open source flexible et adaptatif, répondant aux besoins spécifiques de notre communauté éducative. Nos objectifs principaux sont :\nEncourager la réutilisabilité des ressources pédagogiques.\nIntégrer et rendre interopérables une multitude de ressources.\nFaciliter l'adoption et l'adaptation de nos ressources par d'autres.\nOffrir des ressources pédagogiques libres, gratuites et de qualité.\nPromouvoir la correction, la validation et la curation des ressources de manière collaborative et par les pairs.\nGarantir la liberté de publication pour permettre à tous de contribuer.\nCréer un environnement propice à la collaboration productive.\nProposer des ressources adaptées à différents niveaux de compétence linguistique.\nRespecter scrupuleusement le RGPD, ainsi que l'éthique et la déontologie des métiers de l'enseignement.","public-cible-et-utilisateurs#Public cible et utilisateurs":"PLaTon est destiné principalement aux enseignants et aux étudiants dans le secteur de l'éducation.\nLes enseignants peuvent l'utiliser pour créer des exercices interactifs, planifier des cours et évaluer les performances des étudiants,\ntandis que les étudiants bénéficient d'une plateforme d'apprentissage interactif pour renforcer leurs compétences et connaissances.","structure-de-la-documentation#Structure de la documentation":"Cette documentation est structurée de manière à fournir une compréhension claire et détaillée de toutes les facettes de PLaTon.\nElle est divisée en plusieurs chapitres, chacun abordant des aspects spécifiques de la plateforme, depuis son utilisation générale jusqu'aux fonctionnalités avancées.","comment-utiliser-cette-documentation#Comment utiliser cette documentation":"La documentation est conçue pour être intuitive et facile à naviguer.\nLes utilisateurs peuvent se référer à des sections spécifiques pour obtenir des informations détaillées sur des fonctionnalités particulières\nou parcourir la documentation dans son intégralité pour une compréhension globale de la plateforme.","licences#Licences":"Le cœur de PLaTon est publié sous la licence CeCILL-B, une licence franco-française similaire en termes de flexibilité aux licences BSD.\nNous encourageons la création de ressources sous la licence CC-By-SA 3.0, reconnue internationalement comme une norme pour les œuvres culturelles libres, afin de favoriser le partage et la collaboration au sein de la communauté éducative."}},"/overview/features":{"title":"Aperçu des fonctionnalités clés","data":{"":"PLaTon propose une gamme de fonctionnalités sophistiquées, conçues pour améliorer et faciliter l'expérience d'enseignement et d'apprentissage en ligne.\nLes fonctionnalités suivantes sont essentielles à la plateforme et seront explorées plus en détail dans les prochains chapitres.","gestion-des-utilisateurs#Gestion des Utilisateurs":"La gestion des utilisateurs est une composante cruciale de PLaTon, permettant une administration efficace des comptes des enseignants, des élèves et des administrateurs. Cette fonctionnalité inclut :\nCréation et Gestion des Comptes : Procédures pour l'inscription, la configuration de profils, et la gestion des rôles des utilisateurs.\nAuthentification et Sécurité : Mécanismes pour assurer la sécurité des comptes et la protection des données personnelles.\nSuivi et Analyse : Outils pour surveiller l'activité des utilisateurs, leurs progrès et leur engagement sur la plateforme.","gestion-des-ressources#Gestion des Ressources":"La gestion des ressources sur PLaTon englobe la création, l'édition, et le partage de contenu pédagogique de qualité :\nCréation de Ressources : Outils pour développer divers types de contenus éducatifs.\nÉdition et Mise à Jour : Fonctionnalités pour modifier et actualiser les ressources existantes.\nPartage et Collaboration : Mécanismes pour partager des ressources entre les enseignants, favorisant la collaboration et l'échange de connaissances.","gestion-de-cours#Gestion de Cours":"Cette fonctionnalité permet aux enseignants de concevoir, gérer et optimiser les cours en ligne :\nCréation de Cours : Outils pour structurer et organiser de nouveaux cours.\nAjout de Ressources et de Membres : Intégration facile de matériel pédagogique et gestion des inscriptions des élèves.\nGestion des Correcteurs : Attribution de tâches de correction et suivi des évaluations.\nParamétrage des Cours : Réglage des paramètres tels que les dates d'ouverture et de clôture etc.","programmation-dexercices#Programmation d'Exercices":"Une caractéristique distinctive de PLaTon est sa capacité à permettre la programmation d'exercices interactifs :\nLangage de Programmation Interne : Un langage spécialement conçu pour créer des exercices autocorrigés et interactifs.\nÉdition Graphique : Interfaces utilisateur intuitives pour faciliter la conception d'exercices sans nécessiter de compétences avancées en programmation.\nSystème de Template : Modèles prédéfinis pour accélérer et simplifier la création d'exercices.\nChaque fonctionnalité est conçue pour offrir une expérience utilisateur optimale, en facilitant la gestion des cours, des ressources, et des utilisateurs.\nLes détails complets et les guides d'utilisation de ces fonctionnalités seront fournis dans les chapitres suivants de la documentation."}},"/overview/navigation":{"title":"Navigation dans l'interface","data":{"":"PLaTon est conçu comme une application web intuitive, adoptant une structure d'interface utilisateur commune à de nombreuses applications modernes. L'interface est organisée en trois sections principales pour une navigation fluide et une interaction efficace.","1-la-navigation#1. La navigation":"La barre de navigation est constamment présente sur le côté gauche de l'écran dans toutes les pages de PLaTon. Elle facilite la navigation entre les différentes sections de l'application, affichant uniquement les pages auxquelles vous avez accès en fonction de votre type de compte. Les options incluent :\nTableau de bord :  La page d'accueil de votre compte, montrant les dernières actualités et des statistiques pertinentes, telles que le nombre de cours auxquels vous êtes inscrit.\nAgenda : Affiche les événements à venir, aidant à la planification et à l'organisation.\nCours : Liste tous les cours auxquels vous êtes inscrit, offrant un accès rapide à chacun.\nCorrections : Présente la liste des corrections à effectuer pour les cours suivis.\nEspace de travail : Une zone réservée aux enseignants pour la création et la recherche de ressources pédagogiques.\nAdministration : Offre des outils d'administration de la plateforme, accessible uniquement aux administrateurs.\nMon compte : Permet de consulter et de modifier vos informations de profil.\nDocumentation : Fournit des liens vers diverses ressources documentaires de PLaTon.","2-la-barre-de-menu#2. La barre de menu":"Située en haut de l'écran, la barre de menu est accessible sur toutes les pages de PLaTon. Elle propose des raccourcis pour des actions rapides et fréquentes, symbolisées par des icônes :\nCréation (4) : Permet de créer rapidement un cours, un cercle, une activité ou un exercice.\nThème (5) : Offre la possibilité de basculer entre un thème clair et un thème sombre.\nNotifications (6) : Affiche les notifications reçues sur PLaTon.\nMenu Utilisateur (7) : Un menu déroulant donnant accès à :\nMon compte : Pour accéder à votre profil.\nDéconnexion : Pour se déconnecter de PLaTon.","3-le-contenu#3. Le contenu":"La partie centrale de l'interface, le contenu, affiche les informations relatives à la page actuelle. Cette zone s'adapte en fonction de la section sélectionnée dans la navigation, affichant les détails pertinents des cours, des exercices ou toute autre information en rapport avec la section choisie."}},"/overview/login":{"title":"Connexion à la plateforme","data":{"":"Conçue pour être simple et sécurisée, PLaTon offre plusieurs méthodes de connexion adaptées aux besoins variés des utilisateurs.Lorsque vous accédez à PLaTon, vous êtes accueilli par une page de connexion, invitant à entrer vos identifiants. Cette interface est conçue pour être intuitive, garantissant une expérience utilisateur fluide même pour ceux qui se connectent pour la première fois.","modes-de-connexion#Modes de Connexion":"Pour les utilisateurs avec un compte PLaTon : Vous devez entrer votre adresse e-mail et votre mot de passe associé.\nCe mode de connexion est destiné avant tout aux administrateurs de la plateforme. Pour les autres utilisateurs, il est recommandé de vous connecter avec votre LMS (voir ci-dessous).\nPour les utilisateurs avec un compte LMS :  Si vous utilisez PLaTon dans le cadre d'un LMS comme Moodle ou Canvas, la connexion se fait sans effort grâce à l'intégration LTI.\nEn vous connectant à votre LMS habituel, vous trouverez un lien ou un bouton spécifique pour accéder directement à PLaTon.\nCette méthode simplifie l'accès en éliminant le besoin de se souvenir de multiples identifiants.","procédure-de-connexion#Procédure de Connexion":"Pour les Comptes PLaTon :\nVisitez la page de connexion de PLaTon.\nEntrez vos identifiants de compte PLaTon (e-mail et mot de passe).\nCliquez sur 'Connexion' pour accéder à la plateforme.\nPour les Comptes LMS via LTI :\nConnectez-vous à votre LMS (Moodle, Canvas, etc.).\nRecherchez l'intégration PLaTon ou le lien LTI dédié.\nCliquez sur le lien pour être automatiquement connecté à PLaTon."}},"/resources/activities":{"title":"Gestion des activités","data":{"création#Création":"","comment-créer-une-activité-#Comment créer une activité ?":"","étape-1-choix-du-cercle-parent#Étape 1: Choix du Cercle Parent":"Accédez à l'option \"Créer une activité\" dans la barre de menu de PLaTon en cliquant sur le bouton +.\nSélectionnez le cercle parent dans lequel vous souhaitez ajouter votre activité.\nCliquez sur 'Suivant' pour continuer.\nSi vous ouvrez le formulaire de création d'activité à partir de la page d'une ressource, le cercle parent sera automatiquement sélectionné comme étant le cercle dans lequel se trouve la ressource.","étape-2-entrer-les-informations-de-base#Étape 2: Entrer les Informations de Base":"Remplissez le nom de l'activité. Ce nom devrait être descriptif et refléter le contenu de l'activité.\nFournissez une description claire et concise de l'activité pour informer les utilisateurs de son contenu et de son objectif.\nCliquez sur 'Suivant' pour passer à l'étape suivante.","étape-3-associer-des-tags#Étape 3: Associer des Tags":"Décidez si vous voulez associer des tags à votre activité dès maintenant. Les tags facilitent la recherche et la classification des ressources.\nSélectionnez une liste de 'topics' (sujets) et de 'levels' (niveaux) pour classifier votre activité. Cela aidera les autres utilisateurs à trouver l'activité lorsqu'ils recherchent des ressources spécifiques.\nAprès avoir sélectionné les tags appropriés, cliquez sur 'Créer' pour finaliser la création de votre activité.\nVous pouvez toujours ajouter des tags à votre activité plus tard en accédant à la page des paramètres de l'activité.\nEn suivant ces étapes, vous aurez créé un activité dans PLaTon, prêt à être peuplé avec des exercices pour vos étudiants ou collègues.\nRendez-vous dans la documentation sur la programmation des activités pour en savoir plus."}},"/resources/events":{"title":"Événements","data":{"":"Cette page est en cours de rédaction."}},"/resources/circles":{"title":"Gestion des cercles","data":{"fonctionnalités-clés#Fonctionnalités Clés":"Organisation et Héritage :\nLes cercles opèrent dans une structure hiérarchique où il peut y avoir des sous-cercles. Chaque cercle peut hériter des propriétés et des ressources d'un cercle parent, avec PLaTon étant le cercle le plus élevé. Cette structure d'héritage permet une organisation et une gestion efficaces des ressources éducatives à différents niveaux.\nCercle Principal - PLaTon :\nPLaTon agit comme le cercle racine ou principal. En tant que tel, il constitue la base de l'organisation des ressources et des activités sur la plateforme, fournissant un cadre global pour les sous-cercles.\nCercle Personnel :\nChaque utilisateur a un cercle personnel qui lui est propre. Ce cercle est utilisé pour stocker les ressources personnelles de l'utilisateur, telles que les brouillons et les ressources en cours de développement\net n'est visible que par l'utilisateur lui-même sauf s'il décide de partager le cercle avec d'autres utilisateurs.\nGestion des Collaborateurs :\nLes cercles sont tous visibles à la consultation, mais seuls les administrateurs et les utilisateurs définis comme \"collaborateurs\" peuvent modifier les informations des cercles et y créer des activités et exercices. Cela permet aux administrateurs de contrôler les modifications apportées aux cercles et de s'assurer que les ressources sont correctement gérées.\nFlexibilité dans la Création de Sous-Cercles : Les administrateurs peuvent créer des sous-cercles pour des besoins spécifiques, tels que des projets de groupe, des départements spécifiques, ou des initiatives de recherche.","création#Création":"","comment-créer-un-cercle-#Comment créer un cercle ?":"","étape-1-choix-du-cercle-parent#Étape 1: Choix du Cercle Parent":"Accédez à l'option \"Créer un cercle\" dans la barre de menu de PLaTon en cliquant sur le bouton +.\nSélectionnez le cercle parent dans lequel vous souhaitez ajouter votre nouveau cercle.\nCliquez sur 'Suivant' pour continuer.\nSi vous ouvrez le formulaire de création de cercle à partir de la page d'une ressource, le cercle parent sera automatiquement sélectionné comme étant le cercle dans lequel se trouve la ressource.","étape-2-entrer-les-informations-de-base#Étape 2: Entrer les Informations de Base":"Remplissez le nom du cercle. Ce nom devrait être descriptif et refléter la thématique ou le groupe d'utilisateurs auquel le cercle est destiné.\nEntrez un code unique pour le cercle. Ce code sert d'identifiant unique et non modifiable. Il sera utilisé pour faire référence aux fichiers du cercle depuis une autre ressource.\nFournissez une description claire et concise du cercle pour informer les utilisateurs de son contenu et de son objectif.\nCliquez sur 'Suivant' pour passer à l'étape suivante.","étape-3-associer-des-tags#Étape 3: Associer des Tags":"Décidez si vous voulez associer des tags à votre cercle dès maintenant. Les tags facilitent la recherche et la classification des ressources.\nSélectionnez une liste de 'topics' (sujets) et de 'levels' (niveaux) pour classifier votre cercle. Cela aidera les autres utilisateurs à trouver le cercle lorsqu'ils recherchent des ressources spécifiques.\nAprès avoir sélectionné les tags appropriés, cliquez sur 'Créer' pour finaliser la création de votre cercle.\nVous pouvez toujours ajouter des tags à votre cercle plus tard en accédant à la page des paramètres du cercle.\nEn suivant ces étapes, vous aurez créé un cercle dans PLaTon, prêt à être peuplé avec des activités et des exercices pour vos étudiants ou collègues.\nN'oubliez pas que la gestion efficace des cercles est cruciale pour une organisation et une navigation optimales des ressources pédagogiques sur la plateforme.","vue-densemble#Vue d'Ensemble":"La page \"Vue d'ensemble\" dans PLaTon offre aux utilisateurs un aperçu rapide et intuitif de l'état actuel et de la structure d'un cercle donné.\nElle présente des informations clés et des statistiques qui aident à comprendre la dynamique et l'utilisation des ressources au sein du cercle.","suivi-de-létat-des-ressources#Suivi de l'État des Ressources":"Cette section centrale affiche un diagramme circulaire coloré qui représente la distribution des différents états des ressources du cercle (sous-cercles, activités et exercices):\nPrêt à l'Utilisation : Indique le pourcentage de ressources qui sont complètes et disponibles pour être utilisées immédiatement dans les cours.\nContient des bugs : Représente les ressources qui ont été signalées pour contenir des erreurs et nécessitent une attention.\nBesoin d'être testé : Ressources qui ont été créées ou modifiées et qui attendent une vérification ou un test d'efficacité.\nBrouillon : Une grande partie des ressources peut être en phase de brouillon, indiquant qu'elles sont en cours de développement et ne sont pas encore prêtes pour la publication.\nChaque état est cliquable et redirige vers la page de recherche avec les ressources correspondantes.À droite du diagramme, on trouve des indicateurs numériques clés qui offrent un accès rapide aux différentes catégories de ressources et utilisateurs associés au cercle :\nObservateurs : Le nombre d'utilisateurs qui suivent le cercle pour recevoir des notifications sur les mises à jour.\nCollaborateurs : Les utilisateurs actuellement impliqués dans la création ou la révision des ressources du cercle.\nCercles Enfants : Indique le nombre de sous-cercles reliés au cercle actuel.\nActivités : Le nombre total d'activités liées à ce cercle.\nExercices : Une quantité d'exercices spécifiés qui sont associés au cercle.","tags#Tags":"La section des tags souligne l'importance de classer efficacement les ressources à l'aide de topics (sujets) et de levels (niveaux) pour une organisation et une recherche optimisées.\nElle contient un bouton \"Ajouter des tags\" qui facilite l'attribution de tags aux ressources pour augmenter leur visibilité et accessibilité."}},"/resources/exercises":{"title":"Gestion des exercices","data":{"comment-créer-une-activité-#Comment créer une activité ?":"","étape-1-choix-du-cercle-parent#Étape 1: Choix du Cercle Parent":"Accédez à l'option \"Créer un exercice\" dans la barre de menu de PLaTon en cliquant sur le bouton +.\nSélectionnez le cercle parent dans lequel vous souhaitez ajouter votre exercice.\nCliquez sur 'Suivant' pour continuer.\nSi vous ouvrez le formulaire de création d'exercice à partir de la page d'une ressource, le cercle parent sera automatiquement sélectionné comme étant le cercle dans lequel se trouve la ressource.","étape-2-entrer-les-informations-de-base#Étape 2: Entrer les Informations de Base":"Remplissez le nom de l'exercice. Ce nom devrait être descriptif et refléter le contenu de l'exercice.\nFournissez une description claire et concise de l'exercice pour informer les utilisateurs de son contenu et de son objectif.\nCliquez sur 'Suivant' pour passer à l'étape suivante.","étape-3-associer-des-tags#Étape 3: Associer des Tags":"Décidez si vous voulez associer des tags à votre exercice dès maintenant. Les tags facilitent la recherche et la classification des ressources.\nSélectionnez une liste de 'topics' (sujets) et de 'levels' (niveaux) pour classifier votre exercice. Cela aidera les autres utilisateurs à trouver le cercle lorsqu'ils recherchent des ressources spécifiques.\nAprès avoir sélectionné les tags appropriés, cliquez sur 'Créer' pour finaliser la création de votre exercice.\nVous pouvez toujours ajouter des tags à votre exercice plus tard en accédant à la page des paramètres du exercice.\nEn suivant ces étapes, vous aurez créé un exercice dans PLaTon, prêt à être programmé.\nRendez-vous dans la documentation sur la programmation des exercices pour en savoir plus."}},"/resources/permissions":{"title":"Gestion des droits","data":{"qui-peut-voir-une-ressource#Qui peut voir une ressource?":"Tous les enseignants et administrateurs peuvent voir les ressources sans restriction sauf si la ressource est dans un cercle personnel ou est un cercle personnel.\nIl est possible de rendre visible les cercles personnels à des utilisateurs spécifiques. Pour cela, il faut ajouter les utilisateurs dans la liste des collaborateurs du cercle.","qui-peut-créer-un-cercle#Qui peut créer un cercle?":"Seuls les administrateurs peuvent créer des cercles.","qui-peut-créeréditer-des-activités-et-exercices#Qui peut créer/éditer des activités et exercices?":"Seuls les administrateurs et les utilisateurs définis comme \"collaborateurs\" peuvent créer des activités et exercices.","qui-peut-modifier-les-informations-dune-ressource#Qui peut modifier les informations d'une ressource?":"Seuls les administrateurs et les utilisateurs définis comme \"collaborateurs\" peuvent modifier les informations d'une ressource."}},"/resources/search":{"title":"Recherche de ressources","data":{"":"Cette page est en cours de rédaction."}},"/resources/tags":{"title":"Tags et Classification","data":{"":"Cette page est en cours de rédaction."}},"/resources/types":{"title":"Types de ressource","data":{"introduction#Introduction":"Avant de détailler les différents types de ressources disponibles sur PLaTon, il est essentiel de comprendre ce que nous entendons par \"ressource\" dans le cadre de PLaTon.","définition-dune-ressource-platon#Définition d'une Ressource PLaTon":"Qu'est-ce qu'une Ressource ?\nDans PLaTon, une ressource est définie comme un conteneur pour tout élément ou contenu pédagogique utilisé pour faciliter l'enseignement et l'apprentissage. Cela peut inclure des documents textuels, des vidéos, des exercices interactifs, des présentations, des ensembles de données, des quiz, et bien plus encore.\nLes ressources sont les composants clés qui alimentent le processus éducatif sur la plateforme.\nObjectif des Ressources :\nLes ressources sont conçues pour offrir une expérience d'apprentissage enrichissante, en aidant les enseignants à transmettre des connaissances et les étudiants à acquérir des compétences et des informations de manière efficace et engageante tout en récoltant des données sur la pertinence et l'efficacité des ressources.\nAprès avoir établi ce qu'est une ressource, explorons les types spécifiques de ressources que PLaTon offre : les cercles, les activités et les exercices, ainsi que la façon dont ces éléments interagissent pour créer un environnement d'apprentissage structuré et intégré.","les-cercles#Les Cercles":"","icône#Icône":"group_work","définition-et-usage#Définition et Usage":"Un cercle dans PLaTon est une entité organisationnelle qui regroupe diverses ressources et utilisateurs autour d'un thème, d'un sujet ou d'un objectif commun. Il peut s'agir d'une matière spécifique, d'un projet de recherche, ou d'une communauté d'enseignement.","les-activités#Les Activités":"","icône-1#Icône":"widgets","définition-et-usage-1#Définition et Usage":"Une activité est une tâche ou un ensemble de tâches conçues pour engager les étudiants dans un processus d'apprentissage.","intégration-dans-les-cercles#Intégration dans les Cercles":"Les activités sont associées à des cercles spécifiques, permettant une organisation thématique et une navigation simplifiée.","les-exercices#Les Exercices":"","icône-2#Icône":"article","définition-et-usage-2#Définition et Usage":"Un exercice est une tâche spécifique, souvent autocorrigée, conçue pour tester ou renforcer les compétences et connaissances des étudiants dans un domaine particulier.","intégration-dans-les-activités#Intégration dans les Activités":"Les exercices peuvent être incorporés dans les activités pour fournir une expérience d'apprentissage pratique et interactive."}},"/resources/watchers":{"title":"Observateurs","data":{"":"Bien que toutes les ressources soient accessibles sur la plateforme, il est nécessaire de pouvoir choisir lesquelles suivre afin de rester informé des dernières modifications\net de pouvoir les retrouver plus facilement. Pour cela, PLaTon propose un système d'observateurs.","devenir-observateur#Devenir observateur":"Pour devenir observateur d'une ressource, il suffit de cliquer sur le bouton \"Suivre\" présent sur la page de la ressource.\nUne fois observateur, il est possible de se désabonner en cliquant sur le bouton \"Ne plus suivre\" présent sur la page de la ressource.\nLorsqu'on créé une ressource, on devient automatiquement observateur de celle-ci.","avantages#Avantages":"Pour un exercice, suivre l'exercice permet de l'ajouter à des activités.\nPour une activité, suivre l'activité permet de l'ajouter à des cours.\nDes notifications sont envoyées en cas de changement important (changement de status, ajout d'activités et exercices, etc.)\nSeules les ressources suivies sont ajoutables dans les cours et activités pour des raisons de performances."}},"/users/account-types":{"title":"Types de Comptes","data":{"types-de-comptes#Types de Comptes":"Dans PLaTon, différents types de comptes sont disponibles, chacun offrant des niveaux d'accès et des fonctionnalités spécifiques. Ces types de comptes déterminent les actions que les utilisateurs peuvent effectuer sur la plateforme. Voici une description détaillée de chaque type de compte et de leurs capacités respectives.","compte-administrateur-système#Compte Administrateur Système":"Les administrateurs système ont le niveau d'accès le plus élevé sur PLaTon. Ils sont responsables de la gestion globale de la plateforme au sein de leur établissement.Actions Possibles :\nGestion des Utilisateurs : Création, modification et désactivation des comptes utilisateurs.\nConfiguration de la Plateforme : Réglage des paramètres globaux de PLaTon, comme les options de sécurité, les intégrations LTI et la maintenance.\nSurveillance et Rapports : Accès à des outils analytiques pour surveiller l'utilisation de la plateforme et générer des rapports détaillés.\nGestion des Ressources : Capacité de visualiser, éditer ou supprimer toutes les ressources créées par les utilisateurs.","compte-enseignant#Compte Enseignant":"Les comptes enseignants sont conçus pour ceux qui développent et gèrent le contenu éducatif et les cours sur PLaTon.Actions Possibles :\nCréation de Cours et d'Activités : Développement et organisation de cours, de leçons et d'exercices interactifs.\nGestion des Inscriptions : Inscription des étudiants dans leurs cours et attribution des correcteurs.\nSuivi des Performances : Accès à des outils pour suivre et évaluer les progrès des étudiants.\nPartage de Ressources : Partage de matériel pédagogique avec d'autres enseignants ou étudiants.","compte-étudiant#Compte Étudiant":"Les comptes étudiants sont destinés aux apprenants utilisant PLaTon pour leur formation.Actions Possibles :\nAccès aux Cours : Participation aux cours et activités proposés sur la plateforme.\nSoumission de Travaux : Envoi de devoirs et participation à des exercices interactifs.\nConsultation des Résultats : Visualisation des retours sur leurs travaux et suivi de leur progression.\nInteraction et Collaboration : Utilisation des forums de discussion et des outils de collaboration pour interagir avec les enseignants et les autres étudiants.","compte-invité#Compte Invité":"Le \"compte invité\" dans PLaTon n'est pas un compte à proprement parler, dans le sens traditionnel des systèmes de gestion d'utilisateurs. Au lieu de cela, il s'agit d'une désignation spécifique pour les utilisateurs qui accèdent à des ressources partagées publiquement en dehors de la plateforme PLaTon, comme des exercices de démonstration ou du contenu éducatif ouvert.Caractéristiques Principales :\nAccès Sans Enregistrement : Les utilisateurs désignés comme \"invités\" peuvent accéder à certaines ressources sans nécessiter de compte ou d'enregistrement sur PLaTon.\nUtilisation Limitée : Leur interaction avec la plateforme est limitée à la visualisation ou à la participation à des activités spécifiquement partagées pour un usage public.\nAucune Sauvegarde en Base : Contrairement aux autres types de comptes, les informations des utilisateurs invités ne sont pas sauvegardées dans la base de données de PLaTon. Leur accès est temporaire et spécifique aux ressources auxquelles ils ont accès.\nIdéal pour la Démonstration : Ce type d'accès est particulièrement utile pour présenter des fonctionnalités de PLaTon à des non-utilisateurs, comme lors de démonstrations ou de présentations publiques.","note-importante-sur-la-cumulativité-des-actions-par-rôle#Note Importante sur la Cumulativité des Actions par Rôle":"Il est essentiel de noter que dans PLaTon, les actions permises par les différents rôles sont cumulatives. Cela signifie que chaque rôle supérieur intègre les capacités et les permissions des rôles situés en dessous de lui dans la hiérarchie. Par exemple :\nEnseignants : En plus de leurs propres fonctions spécifiques, comme la création de cours et la gestion des inscriptions, les enseignants peuvent effectuer toutes les actions qu'un étudiant peut réaliser. Cela inclut l'accès aux cours, la participation aux activités, et la soumission des travaux.\nAdministrateurs : Les administrateurs, ayant le niveau d'accès le plus élevé, peuvent réaliser non seulement leurs tâches administratives, mais aussi toutes les actions accessibles aux enseignants et aux étudiants. Cela comprend la création de contenu, la gestion des cours, et la participation aux activités éducatives.\nCette structure de permissions assure que les utilisateurs peuvent effectuer toutes les tâches pertinentes à leur rôle, tout en conservant un accès aux fonctionnalités essentielles des rôles inférieurs, garantissant ainsi une flexibilité et une efficacité optimales dans l'utilisation de la plateforme PLaTon."}},"/resources/members":{"title":"Collaboration dans les Cercles","data":{"accès-et-permissions#Accès et Permissions":"Dans PLaTon, bien que tous les cercles soient visibles pour consultation par les utilisateurs de la plateforme,\nseuls les collaborateurs et les administrateurs d'un cercle donné ont la capacité de modifier les informations du cercle ou de publier des ressources en son sein.\nCela garantit que la gestion des contenus est réalisée par des utilisateurs autorisés, maintenant ainsi l'intégrité et la qualité des ressources éducatives.","devenir-collaborateur-dun-cercle#Devenir Collaborateur d'un Cercle":"Il existe deux méthodes pour obtenir le statut de collaborateur dans un cercle :","1-invitation-par-un-administrateur#1. Invitation par un Administrateur":"","processus-dinvitation#Processus d'Invitation":"Un administrateur du cercle accède à la page des collaborateurs, où il peut voir la liste des membres actuels et inviter de nouveaux collaborateurs.\nPour envoyer une invitation, l'administrateur entre le nom ou l'e-mail de l'utilisateur et sélectionne 'Inviter'.\nUne fois l'invitation envoyée, l'administrateur peut voir la liste des invitations en attente, avec la possibilité de les annuler.","réception-et-gestion-des-invitations#Réception et Gestion des Invitations":"L'utilisateur invité reçoit une notification, laquelle contient des boutons 'Accepter' ou 'Refuser', lui permettant de choisir de rejoindre le cercle en tant que collaborateur ou de décliner l'invitation.","2-demande-dadhésion-personnelle#2. Demande d'Adhésion Personnelle":"","faire-une-demande#Faire une Demande":"Un utilisateur souhaitant devenir collaborateur d'un cercle peut initier une demande en naviguant sur la page du cercle et en cliquant sur le bouton 'Demander à rejoindre' situé dans la barre des actions.\nUne fois la demande soumise, l'utilisateur peut l'annuler à tout moment en cliquant sur le bouton 'Annuler la demande de rejoindre' situé dans la barre des actions.","notification-et-approbation-des-demandes#Notification et Approbation des Demandes":"Une fois la demande soumise, les administrateurs du cercle reçoivent une notification. Ils peuvent alors consulter la demande dans la page des collaborateurs et décider de l'accepter ou de la refuser.\nLes demandes approuvées permettent à l'utilisateur de devenir collaborateur, avec la possibilité de modifier les informations du cercle et de contribuer au contenu.","rôles-et-responsabilités#Rôles et Responsabilités":"En tant que collaborateur, un utilisateur acquiert des responsabilités supplémentaires au sein du cercle, telles que la maintenance du contenu et l'interaction avec les autres membres.\nLes administrateurs, quant à eux, gardent une vue d'ensemble et un contrôle sur la gestion des collaborateurs, s'assurant que le cercle reste un espace productif et conforme à ses objectifs pédagogiques."}},"/users/groups":{"title":"Gestion des Groupes Utilisateurs","data":{"":"La gestion des groupes utilisateurs est une fonctionnalité clé pour les administrateurs sur PLaTon.\nElle permet de regrouper les utilisateurs selon divers critères et besoins, tels que des classes, des groupes de travaux pratiques, ou des équipes d'enseignants.\nCe chapitre aborde la création, la modification et la gestion des membres des groupes, ainsi que les différents cas d'utilisation.","création-et-modification-de-groupes#Création et Modification de Groupes":"","création-de-groupe#Création de Groupe":"Ajout d'un Nouveau Groupe : Les administrateurs peuvent créer de nouveaux groupes en spécifiant des informations telles que le nom du groupe, sa description, et son objectif.\nParamètres du Groupe : Il est possible de définir des paramètres spécifiques pour chaque groupe, comme des règles d'accès ou des rôles spéciaux au sein du groupe.","modification-de-groupe#Modification de Groupe":"Édition des Informations : Les administrateurs peuvent modifier les informations d'un groupe à tout moment, y compris son nom, sa description et ses paramètres.\nSuppression de Groupe : Un groupe peut être supprimé si nécessaire. Cette action doit être effectuée avec prudence car elle peut affecter l'accès des utilisateurs aux ressources liées au groupe.","gestion-des-membres-du-groupe#Gestion des Membres du Groupe":"","ajout-et-suppression-de-membres#Ajout et Suppression de Membres":"Assignation des Membres : Les administrateurs peuvent ajouter des utilisateurs aux groupes, soit individuellement, soit en masse.\nRetrait de Membres : De même, les membres peuvent être retirés d'un groupe si leur participation n'est plus nécessaire ou appropriée.","cas-dutilisation-des-groupes#Cas d'Utilisation des Groupes":"","exemples-pratiques#Exemples Pratiques":"Classes : Création de groupes pour des classes spécifiques, facilitant la gestion des cours et des ressources pour un ensemble d'étudiants.\nGroupes de Travaux Pratiques : Formation de petits groupes pour des sessions de travaux pratiques ou des projets de groupe.\nGroupe d'Enseignants : Regroupement des enseignants par département ou par matière pour faciliter la collaboration et le partage de ressources.\nCorrecteurs : Création de groupes de correcteurs pour des évaluations ou des examens, permettant une répartition efficace des tâches de correction.","interface-de-gestion-des-groupes#Interface de Gestion des Groupes":"","conception-et-fonctionnalités#Conception et Fonctionnalités":"Interface Intuitive : L'interface de gestion des groupes est conçue pour être facile à utiliser, permettant une gestion rapide et efficace des groupes et de leurs membres.\nVisibilité et Contrôle : Les administrateurs ont une vue complète sur tous les groupes existants sur la plateforme et peuvent gérer ces groupes de manière centralisée.\nLa gestion des groupes utilisateurs est un outil puissant dans PLaTon, offrant aux administrateurs la flexibilité nécessaire pour organiser les utilisateurs de manière efficace et logique. Que ce soit pour des besoins académiques, administratifs ou de collaboration, cette fonctionnalité facilite la gestion et l'optimisation de l'expérience utilisateur sur la plateforme."}},"/users/lti-integration":{"title":"Intégration LTI","data":{"explication-du-fonctionnement-de-lti-learning-tools-interoperability#Explication du Fonctionnement de LTI (Learning Tools Interoperability)":"Learning Tools Interoperability (LTI) est une norme développée par l'IMS Global Learning Consortium.\nElle permet l'intégration transparente de divers outils d'apprentissage et de contenus dans des systèmes de gestion de l'apprentissage (LMS).\nLTI facilite la communication entre les plateformes d'apprentissage et les outils externes, permettant aux utilisateurs de bénéficier d'une expérience d'apprentissage unifiée sans avoir à se connecter séparément à chaque outil.","platon-en-tant-quoutil-lti#PLaTon en tant qu'Outil LTI":"PLaTon est conçu comme un outil LTI, ce qui signifie qu'il peut s'intégrer facilement dans n'importe quel LMS compatible LTI, comme Moodle, Canvas ou Blackboard.\nCette intégration permet aux enseignants et aux étudiants d'accéder à PLaTon directement à partir de leur LMS habituel, en utilisant leurs identifiants existants.","ajouter-un-lms-à-platon#Ajouter un LMS à PLaTon":"Pour intégrer un LMS avec PLaTon, vous devez fournir les informations suivantes dans l'espace d'administration des LMS :\nNom : Nommez votre intégration LMS pour la distinguer facilement dans PLaTon.\nURL : L'adresse URL du LMS avec lequel vous souhaitez intégrer PLaTon.\nURL de résultat : Cette URL est utilisée par PLaTon pour renvoyer les informations au LMS, telles que les scores ou les progrès des étudiants.\nClé : Une clé unique fournie par le LMS pour authentifier l'intégration.\nSecret : Un secret partagé entre PLaTon et le LMS, utilisé en conjonction avec la clé pour sécuriser la communication.\nCes informations permettent une communication sécurisée entre PLaTon et le LMS, garantissant que les données des utilisateurs sont protégées et que l'interaction entre les deux systèmes est fluide.","se-connecter-à-platon-depuis-un-lms--exemple-avec-moodle#Se Connecter à PLaTon depuis un LMS : Exemple avec Moodle":"Pour vous connecter à PLaTon depuis Moodle :","configuration-dans-moodle-#Configuration dans Moodle :":"Allez dans la section de gestion des plugins ou modules complémentaires de Moodle.\nAjoutez un nouvel outil externe en spécifiant l'URL de PLaTon (https://platon.example.com/api/v1/lti/launch), la clé et le secret fournis.\nPour plus de détails sur la configuration de l'outil externe dans Moodle, consultez la documentation Moodle :","utilisation-par-les-enseignants-et-les-étudiants-#Utilisation par les Enseignants et les Étudiants :":"Une fois configuré par un adminstrateur Moodle, les enseignants peuvent ajouter l'outil externe à leurs cours Moodle en suivant les instructions ici.\nDéfinissez Preconfigured tool sur Automatic, based on launch URL et entrez https://platon.example.com/api/v1/lti/launch?next=PAGE_URL dans le champ Tool URL (en remplaçant PAGE_URL par l'URL de la page de destination dans PLaTon).\nLorsque les enseignants et les étudiants cliquent sur le lien de l'outil externe dans leur cours Moodle, ils sont automatiquement redirigés et connectés à PLaTon, les emmenant directement à la page spécifiée après next=.\nSi la page cible est un cours, ils seront inscrits automatiquement dans le cours sur PLaTon.\nLes cours dans PLaTon intègrent un bouton partage qui permet aux enseignants de générer un lien direct vers la page de destination dans PLaTon. Ce lien peut être utilisé pour configurer l'outil externe dans Moodle."}},"/users/lti-roles":{"title":"Assignation des Rôles via LTI","data":{"":"Dans PLaTon, l'assignation des rôles des utilisateurs est fortement influencée par les paramètres de la requête LTI (Learning Tools Interoperability).\nLorsqu'un utilisateur se connecte à PLaTon via un LMS (Learning Management System) utilisant LTI, son rôle dans PLaTon est déterminé par les rôles LTI qui lui sont attribués dans le LMS.\nVoici comment ces rôles sont mappés dans PLaTon :","assignation-des-rôles-lti#Assignation des Rôles LTI":"PLaTon utilise les rôles LTI pour attribuer des rôles spécifiques aux utilisateurs en fonction de leur fonction dans le système éducatif.\nCes rôles LTI sont classés en quatre grandes catégories : AdminRoles, InstructorRoles, StudentRoles et ReviewerRoles.","1-adminroles#1. AdminRoles":"Ces rôles sont attribués aux utilisateurs ayant des responsabilités administratives dans le LMS. Les utilisateurs avec ces rôles dans le LMS seront généralement assignés à des rôles administratifs dans PLaTon, leur permettant de gérer la plateforme, les comptes utilisateurs et les configurations systèmes.","2-instructorroles#2. InstructorRoles":"Les utilisateurs avec des rôles d'instructeur dans le LMS sont considérés comme des enseignants ou des créateurs de contenu dans PLaTon. Ils ont la capacité de créer des cours, des exercices, de gérer les inscriptions des étudiants et de suivre leurs progrès.","3-studentroles#3. StudentRoles":"Les rôles d'étudiants dans le LMS correspondent à des comptes étudiants dans PLaTon. Ces utilisateurs ont accès aux cours, peuvent soumettre des travaux, participer à des activités et accéder à leur matériel éducatif.","4-reviewerroles#4. ReviewerRoles":"Ces rôles incluent des fonctions de soutien et de mentorat comme les tuteurs, les mentors, ou les assistants d'enseignement. Dans PLaTon, ils sont considérés comme des étudiants, mais vous pouvez leur donner des rôles de correcteurs dans les cours auxquels ils sont inscrits pour mieux refléter leurs responsabilités si nécessaire.\nTout utilisateur PLaTon peut être assigné en tant que correcteur dans un cours à condition qu'il soit inscrit à ce cours.","exemple-dassignation-de-rôle#Exemple d'Assignation de Rôle":"Lorsqu'un utilisateur se connecte à PLaTon via une requête LTI depuis un LMS, les rôles LTI qui lui sont attribués dans le LMS sont transmis dans la requête.\nPLaTon utilise ces informations pour déterminer le rôle approprié pour l'utilisateur sur la plateforme.\nPar exemple, si un utilisateur se connecte avec le rôle LTI urn:lti:instrole:ims/lis/Instructor, PLaTon l'identifiera comme un enseignant, lui donnant accès aux fonctionnalités associées à ce rôle.Cette méthode d'assignation des rôles assure que les utilisateurs ont le niveau d'accès et les fonctionnalités appropriés dans PLaTon, reflétant leur rôle et leurs responsabilités dans leur environnement éducatif.\nCette intégration étroite entre les rôles LTI et PLaTon permet une gestion efficace des utilisateurs et une expérience utilisateur cohérente entre le LMS et la plateforme PLaTon."}},"/users/profile":{"title":"Gestion des Profils Utilisateurs","data":{"":"Ce chapitre détaille les actions réalisables par les administrateurs dans la section dédiée à la gestion des profils utilisateurs sur PLaTon.\nCette gestion est cruciale pour maintenir l'ordre et l'efficacité au sein de la plateforme, en permettant aux administrateurs de contrôler l'accès et les rôles des utilisateurs.","liste-des-utilisateurs#Liste des Utilisateurs":"","fonctionnalités-de-la-liste#Fonctionnalités de la Liste":"Affichage et Tri : Les utilisateurs sont listés dans une table facilement navigable. Les administrateurs peuvent trier cette liste par différents critères tels que le nom, ou la date de création du compte en cliquant sur les en-têtes de colonne.\nFiltres Avancés : Des filtres sont disponibles pour affiner la recherche d'utilisateurs selon leur rôle (enseignant, étudiant, administrateur, etc.) ou leur statut. Cela permet une gestion plus rapide et plus précise.","gestion-de-lactivité-des-utilisateurs#Gestion de l'Activité des Utilisateurs":"","actions-sur-les-comptes-utilisateurs#Actions sur les Comptes Utilisateurs":"Désactivation d'un Utilisateur : Cette action bloque l'accès à l'application pour l'utilisateur concerné. Un utilisateur désactivé ne pourra plus se connecter ni accéder à ses cours ou ressources jusqu'à ce que son compte soit réactivé.\nActivation d'un Utilisateur : Si un compte a été désactivé, cette action permet de rétablir l'accès de l'utilisateur à l'application. Une fois activé, l'utilisateur récupère ses accès et peut reprendre ses activités normalement sur la plateforme.","modification-des-rôles-utilisateurs#Modification des Rôles Utilisateurs":"","changement-de-rôle#Changement de Rôle":"Changer le Rôle d'un Utilisateur : Les administrateurs ont la capacité de modifier le rôle d'un utilisateur (par exemple, de passer un étudiant à enseignant ou vice versa). Ce changement peut être nécessaire pour refléter l'évolution du statut de l'utilisateur dans l'établissement ou pour corriger des attributions de rôles initiales.","interface-administrateur#Interface Administrateur":"Conception et Accessibilité\nInterface Conviviale : L'interface de gestion des profils est conçue pour être intuitive et facile à utiliser, permettant aux administrateurs de gérer efficacement les comptes sans difficulté technique.\nAccès Sécurisé : Seuls les utilisateurs ayant des privilèges administratifs peuvent accéder à cette section, garantissant la sécurité et la confidentialité des informations des utilisateurs.\nEn résumé, la gestion des profils utilisateurs dans PLaTon donne aux administrateurs le pouvoir de superviser efficacement\nles comptes utilisateurs, en assurant que l'accès à la plateforme est accordé de manière appropriée et que les rôles des utilisateurs sont correctement attribués.\nCette gestion joue un rôle crucial dans le maintien de l'ordre et de la sécurité sur la plateforme."}}}