{"/doc/courses/corrections":{"title":"Gestion des corrections","data":{"":"Cette page est en cours de construction"}},"/doc/annexes":{"title":"Annexes","data":{"":"Annexes : Glossaire des Termes UtilisésVoici un glossaire des termes employés tout au long de la documentation pour faciliter la compréhension et l'usage de la plateforme PLaTon :\nActivité : Ensemble structuré d'exercices que les apprenants doivent réaliser. Une activité peut être composée d'un ou plusieurs exercices.\nAPI : Interface de programmation d'applications (Application Programming Interface) qui permet la communication entre différents logiciels.\nBuilder : Script ou partie de code dans PLaTon dédié à la construction d'un exercice, préparant les données avant que l'étudiant ne commence l'exercice.\nComposant : Élément d'interface utilisateur ou bloc fonctionnel utilisé dans la création d'exercices sur PLaTon.\nConfigurable : Attribut d'un exercice qui peut être modifié ou personnalisé à l'aide de paramètres spécifiques.\nExercice : Tâche ou problème posé aux apprenants pour évaluation ou pratique.\nGrader : Script ou partie de code qui évalue les réponses des apprenants et attribue des scores.\nIDE : Environnement de développement intégré (Integrated Development Environment) où les utilisateurs peuvent écrire et tester leur code.\nNavigation Dynamique : Capacité d'une activité à guider l'apprenant à travers les exercices de manière adaptative, basée sur son progrès ou ses réponses.\nPlayer : Composant au sein de PLaTon qui permet aux apprenants de visualiser et interagir avec les exercices et les activités.\nSandbox : Environnement virtuel sécurisé où le code des exercices est exécuté isolément pour éviter tout effet indésirable sur le reste du système.\nSession : Période de temps pendant laquelle un apprenant est activement engagé dans un exercice ou une activité.\nTemplate Nunjucks : Langage de templating utilisé dans PLaTon pour insérer des variables et des logiques de programmation dans le contenu textuel d'un exercice.\nVariable : Élément de programmation qui stocke une valeur pouvant être modifiée et utilisée dans différents contextes au sein d'un exercice.\nWYSIWYG : Acronyme pour \"What You See Is What You Get\", désignant un éditeur qui permet de composer le contenu dans une forme qui ressemble à sa présentation finale.\nCe glossaire vise à fournir une référence rapide pour les termes techniques et spécifiques à PLaTon rencontrés par les utilisateurs lors de la création et de la gestion d'exercices et d'activités éducatives."}},"/doc/courses/activities":{"title":"Ajouter des activités dans un cours","data":{"":"Cette page est en cours de construction"}},"/doc/courses/create":{"title":"Création d'un cours","data":{"":"Cette page est en cours de construction"}},"/doc/courses/members":{"title":"Gestion des membres d'un cours","data":{"":"Cette page est en cours de construction"}},"/doc/courses/overview":{"title":"Présentation du module de cours","data":{"":"Cette page est en cours de construction"}},"/doc/dashboard/admin":{"title":"Tableau de bord administrateur","data":{"":"Cette page est en cours de construction."}},"/doc/dashboard/student":{"title":"Tableau de bord apprenant","data":{"":"Cette page est en cours de construction."}},"/doc/overview/features":{"title":"Aperçu des fonctionnalités clés","data":{"":"PLaTon propose une gamme de fonctionnalités sophistiquées, conçues pour améliorer et faciliter l'expérience d'enseignement et d'apprentissage en ligne.\nLes fonctionnalités suivantes sont essentielles à la plateforme et seront explorées plus en détail dans les prochains chapitres.","gestion-des-utilisateurs#Gestion des Utilisateurs":"La gestion des utilisateurs est une composante cruciale de PLaTon, permettant une administration efficace des comptes des enseignants, des élèves et des administrateurs. Cette fonctionnalité inclut :\nCréation et Gestion des Comptes : Procédures pour l'inscription, la configuration de profils, et la gestion des rôles des utilisateurs.\nAuthentification et Sécurité : Mécanismes pour assurer la sécurité des comptes et la protection des données personnelles.\nSuivi et Analyse : Outils pour surveiller l'activité des utilisateurs, leurs progrès et leur engagement sur la plateforme.","gestion-des-ressources#Gestion des Ressources":"La gestion des ressources sur PLaTon englobe la création, l'édition, et le partage de contenu pédagogique de qualité :\nCréation de Ressources : Outils pour développer divers types de contenus éducatifs.\nÉdition et Mise à Jour : Fonctionnalités pour modifier et actualiser les ressources existantes.\nPartage et Collaboration : Mécanismes pour partager des ressources entre les enseignants, favorisant la collaboration et l'échange de connaissances.","gestion-de-cours#Gestion de Cours":"Cette fonctionnalité permet aux enseignants de concevoir, gérer et optimiser les cours en ligne :\nCréation de Cours : Outils pour structurer et organiser de nouveaux cours.\nAjout de Ressources et de Membres : Intégration facile de matériel pédagogique et gestion des inscriptions des élèves.\nGestion des Correcteurs : Attribution de tâches de correction et suivi des évaluations.\nParamétrage des Cours : Réglage des paramètres tels que les dates d'ouverture et de clôture etc.","programmation-dexercices#Programmation d'Exercices":"Une caractéristique distinctive de PLaTon est sa capacité à permettre la programmation d'exercices interactifs :\nLangage de Programmation Interne : Un langage spécialement conçu pour créer des exercices autocorrigés et interactifs.\nÉdition Graphique : Interfaces utilisateur intuitives pour faciliter la conception d'exercices sans nécessiter de compétences avancées en programmation.\nSystème de Template : Modèles prédéfinis pour accélérer et simplifier la création d'exercices.\nChaque fonctionnalité est conçue pour offrir une expérience utilisateur optimale, en facilitant la gestion des cours, des ressources, et des utilisateurs.\nLes détails complets et les guides d'utilisation de ces fonctionnalités seront fournis dans les chapitres suivants de la documentation."}},"/doc/overview/login":{"title":"Connexion à la plateforme","data":{"":"Conçue pour être simple et sécurisée, PLaTon offre plusieurs méthodes de connexion adaptées aux besoins variés des utilisateurs.Lorsque vous accédez à PLaTon, vous êtes accueilli par une page de connexion, invitant à entrer vos identifiants. Cette interface est conçue pour être intuitive, garantissant une expérience utilisateur fluide même pour ceux qui se connectent pour la première fois.","modes-de-connexion#Modes de Connexion":"Pour les utilisateurs avec un compte PLaTon : Vous devez entrer votre adresse e-mail et votre mot de passe associé.\nCe mode de connexion est destiné avant tout aux administrateurs de la plateforme. Pour les autres utilisateurs, il est recommandé de vous connecter avec votre LMS (voir ci-dessous).\nPour les utilisateurs avec un compte LMS : Si vous utilisez PLaTon dans le cadre d'un LMS comme Moodle ou Canvas, la connexion se fait sans effort grâce à l'intégration LTI.\nEn vous connectant à votre LMS habituel, vous trouverez un lien ou un bouton spécifique pour accéder directement à PLaTon.\nCette méthode simplifie l'accès en éliminant le besoin de se souvenir de multiples identifiants.","procédure-de-connexion#Procédure de Connexion":"Pour les Comptes PLaTon :\nVisitez la page de connexion de PLaTon.\nEntrez vos identifiants de compte PLaTon (e-mail et mot de passe).\nCliquez sur 'Connexion' pour accéder à la plateforme.\nPour les Comptes LMS via LTI :\nConnectez-vous à votre LMS (Moodle, Canvas, etc.).\nRecherchez l'intégration PLaTon ou le lien LTI dédié.\nCliquez sur le lien pour être automatiquement connecté à PLaTon."}},"/doc/dashboard/teacher":{"title":"Tableau de bord enseignant","data":{"":"Cette page est en cours de construction."}},"/doc/courses/statistics":{"title":"Suivi de la progression des apprennants","data":{"":"Cette page est en cours de construction"}},"/doc/overview/navigation":{"title":"Navigation dans l'interface","data":{"":"PLaTon est conçu comme une application web intuitive, adoptant une structure d'interface utilisateur commune à de nombreuses applications modernes. L'interface est organisée en trois sections principales pour une navigation fluide et une interaction efficace.","1-la-navigation#1. La navigation":"La barre de navigation est constamment présente sur le côté gauche de l'écran dans toutes les pages de PLaTon. Elle facilite la navigation entre les différentes sections de l'application, affichant uniquement les pages auxquelles vous avez accès en fonction de votre type de compte. Les options incluent :\nTableau de bord : La page d'accueil de votre compte, montrant les dernières actualités et des statistiques pertinentes, telles que le nombre de cours auxquels vous êtes inscrit.\nAgenda : Affiche les événements à venir, aidant à la planification et à l'organisation.\nCours : Liste tous les cours auxquels vous êtes inscrit, offrant un accès rapide à chacun.\nCorrections : Présente la liste des corrections à effectuer pour les cours suivis.\nEspace de travail : Une zone réservée aux enseignants pour la création et la recherche de ressources pédagogiques.\nAdministration : Offre des outils d'administration de la plateforme, accessible uniquement aux administrateurs.\nMon compte : Permet de consulter et de modifier vos informations de profil.\nDocumentation : Lien vers la documentation de PLaTon.","2-la-barre-de-menu#2. La barre de menu":"Située en haut de l'écran, la barre de menu est accessible sur toutes les pages de PLaTon. Elle propose des raccourcis pour des actions rapides et fréquentes, symbolisées par des icônes :\nCréation (4) : Permet de créer rapidement un cours, un cercle, une activité ou un exercice.\nThème (5) : Offre la possibilité de basculer entre un thème clair et un thème sombre.\nNotifications (6) : Affiche les notifications reçues sur PLaTon.\nMenu Utilisateur (7) : Un menu déroulant donnant accès à :\nMon compte : Pour accéder à votre profil.\nDéconnexion : Pour se déconnecter de PLaTon.","3-le-contenu#3. Le contenu":"La partie centrale de l'interface, le contenu, affiche les informations relatives à la page actuelle. Cette zone s'adapte en fonction de la section sélectionnée dans la navigation, affichant les détails pertinents des cours, des exercices ou toute autre information en rapport avec la section choisie."}},"/doc/programing/activity/files":{"title":"Structure d'une activité","data":{"":"En plus d'éventuels fichiers de ressources (images, sons, etc.), une activité est composé des fichiers suivants :\nmain.pla (PLaTon activity)\nFichier principal contenant le code de l'activité. Ce fichier ne peut pas être supprimé.\nreadme.md\nDocument explicatif de l'activité, à usage des enseignants.\nLorsque vous créer une activité, ces fichiers sont automatiquement générés avec une activité vide. Vous pouvez ensuite les modifier à votre guise en suivant la suite de la documentation de ce module."}},"/doc/programing/activity/exercices":{"title":"Ajout d'Exercices à une Activité","data":{"":"La phase finale de la configuration d'une activité sur PLaTon implique l'ajout d'exercices.\nCes exercices peuvent être organisés en groupes, une fonctionnalité qui prévoit la possibilité d'une navigation dynamique adaptée au progrès de l'apprenant dans de futures mises à jour de PLaTon.\nVoici comment ajouter et organiser des exercices au sein d'une activité :","création-de-groupes-dexercices#Création de Groupes d'Exercices":"Ajout de Groupes :\nCommencez par ajouter des groupes pour organiser les exercices. Les groupes n'affectent pas directement l'activité pour le moment, mais seront utilisés par PLaTon à l'avenir pour une navigation adaptative.\nNommage des Groupes :\nLe nommage des groupes se fait automatiquement en fonction de l'ordre dans lequel ils sont créés. Vous pouvez les réorganiser en les faisant glisser et en les déposant dans l'ordre souhaité.","intégration-dexercices#Intégration d'Exercices":"Sélection de Groupe :\nCliquez sur un groupe pour commencer à y ajouter des exercices.\nAjout d'Exercices :\nUtilisez le bouton d'ajout pour sélectionner et intégrer des exercices à un groupe spécifique. La barre de recherche trouvera que les exercices dont vous êtes observateur.\nConfigurer les Exercices :\nSi un exercice est configurable, vous pouvez cliquer sur le bouton Éditer à droite de celui-çi pour afficher les variables que vous pouvez personnaliser.\nPrévisualisation :\nAvant de finaliser l'ajout, utilisez l'option de prévisualisation pour vérifier que l'exercice fonctionne comme prévu dans le contexte de l'activité.\nPour les exercices configurables, la prévisualisation se base sur les valeurs modifiées s'elles sont définies, sinon sur les valeurs par défaut.\nValidation des Exercices :\nUne fois les exercices ajoutés et configurés, validez votre sélection pour les inclure dans l'activité.","organisation-et-révision#Organisation et Révision":"Réorganiser les Exercices : Vous pouvez réorganiser l'ordre des exercices au sein d'un groupe pour structurer l'activité selon un parcours pédagogique spécifique.\nModifier ou Supprimer des Exercices : À tout moment, vous avez la possibilité de modifier les paramètres d'un exercice ou de le supprimer du groupe si nécessaire.\nAffichage des Variables : Pour les exercices configurables, vous pouvez accéder et modifier les variables en cliquant sur \"Afficher les variables\" pour chaque exercice.\nEn suivant ces étapes, vous pouvez personnaliser de manière approfondie l'expérience d'apprentissage offerte par votre activité. Bien que les groupes n'ont pas d'impact immédiat sur la navigation de l'activité, il est conseillé de les utiliser pour préparer votre activité aux fonctionnalités à venir de PLaTon."}},"/doc/programing/activity/config":{"title":"Configuration d'une activité","data":{"":"Contrairement à un exercice, une activité est écrite entièrement avec un formulaire graphique, sans avoir à écrire du code.\nLe rôle d'une activité est de piloter l'enchaînement des exercices et de contrôler leur comportement comme par exemple le nombre de tentatives autorisées, le temps accordé, etc.Pour ce faire, ouvrez le fichier main.pla de votre activité pour afficher un formulaire de configuration contenant différents onglets :","informations#Informations":"Titre : Le titre de l'activité.\nIntroduction : Une introduction à l'activité en format Markdown.\nConclusion : Une conclusion à l'activité en format Markdown.","paramètres#Paramètres":"","réglez-le-temps-#Réglez le Temps :":"Durée : Définissez la durée totale accordée pour l'activité (hh:mm:ss). Laisser vide pour illimité.","configurez-la-navigation-#Configurez la Navigation :":"Mode : Choisissez entre les modes de navigation :\nComposée : Tous les exercices sont affichés sur une seule page.\nSéquentielle : Les exercices sont affichés un par un.","définissez-les-actions-#Définissez les Actions :":"Tentatives : Indiquez le nombre de tentatives autorisées (-1 pour illimité).\nAides : Cochez si vous souhaitez activer l'affichage des aides.\nAutre question : Autorisez ou non la génération d'une autre question.\nThéories : Activez l'affichage des théories associées aux questions.\nSolution : Permettez l'accès à la solution des exercices.","ajustez-laffichage-de-feedback-#Ajustez l'affichage de Feedback :":"Validation : Cochez pour fournir un feedback après chaque tentative si défini dans l'exercice.\nCorrection : Activez pour que les feedbacks soient affichées à la fin de l'activité si défini dans l'exercice.","paramètres-de-sécurité-#Paramètres de Sécurité :":"La configuration d'une activité sur PLaTon comporte plusieurs options de sécurité qui contrôlent le comportement de l'activité en cas d'interactions spécifiques de l'utilisateur avec la plateforme ou l'appareil.\nVoici les détails de ces options :\nBlocage du copier/coller :\nEmpêchez la copie et le collage de contenu dans toute la page web de l'activité.\nTerminer si clic en dehors :\nLorsque cette option est activée, si l'utilisateur clique en dehors de la fenêtre de l'activité – par exemple,\ns'il passe à une autre application ou consulte une autre fenêtre – l'activité en cours sera automatiquement terminée.\nCette option vise à maintenir la concentration de l'utilisateur sur l'activité et à prévenir la triche ou la distraction.\nTerminer si changement de page :\nCette option, lorsqu'elle est sélectionnée, entraînera la fin de l'activité si l'utilisateur quitte la page de l'activité, comme en naviguant vers un nouvel onglet du navigateur ou en fermant le navigateur lui-même.\nL'objectif est d'assurer que l'utilisateur reste engagé dans l'activité sans interruption ou distraction par d'autres contenus en ligne.\nCes options de sécurité sont conçues pour renforcer l'intégrité de l'expérience d'apprentissage et pour s'assurer que l'utilisateur reste dans l'environnement contrôlé de l'activité pendant toute sa durée.\nElles sont particulièrement utiles dans les contextes d'évaluation où l'attention et l'engagement continus sont essentiels.","scénarios-dapplicatons-des-options-de-sécurité#Scénarios d'applicatons des options de sécurité":"Pour vous aider dans la compréhension des options de sécurité, voici des situations où les options de sécurité \"Terminer si clic en dehors\" et \"Terminer si changement de page\" peuvent entraîner la fin d'une activité sur PLaTon,\naccompagnées d'exemples concrets et de conseils à communiquer aux apprenants :","terminer-si-clic-en-dehors#Terminer si clic en dehors":"Cas d'usage :\nChangement d'application : Si un apprenant passe de PLaTon à une autre application, comme un traitement de texte ou un tableur.\nExemple : Un apprenant ouvre une calculatrice pour aider à résoudre un problème de mathématiques.\nNavigation vers un autre programme : Lorsqu'un apprenant bascule vers un autre programme sur son ordinateur.\nExemple : Un apprenant vérifie ses notifications ou met en pause sa musique via une autre application.\nUtilisation de la console du navigateur : Si un apprenant ouvre la console du navigateur pendant l'activité.\nExemple : Un apprenant ouvre la console du navigateur pour essayer de manipuler le document HTML. Étant donnée que la console ne fait pas partie de la zone de l'activité, cela entraînera la fin de l'activité.","terminer-si-changement-de-page#Terminer si changement de page":"Cas d'usage :\nNavigation vers un autre onglet du navigateur : Si un apprenant clique sur un autre onglet pendant l'activité.\nExemple : L'apprenant recherche une formule sur une page web différente.\n**Fermeture du navigateur ** : Lorsqu'un apprenant ferme le navigateur où se déroule l'activité.\nExemple : Un apprenant ferme par erreur l'onglet de l'activité.\nActualisation de la page : Si l'apprenant actualise la page de l'activité.\nExemple : L'apprenant rafraîchit la page pour essayer de résoudre un problème d'affichage.","conseils-pour-les-apprenants#Conseils pour les Apprenants":"Compréhension claire : Assurez-vous que tous les apprenants comprennent le fonctionnement de ces options de sécurité avant de commencer une activité. Cela devrait être une partie essentielle de l'introduction à toute activité sur PLaTon.\nEnvironnement de travail préparé : Encouragez les apprenants à préparer tout le matériel dont ils pourraient avoir besoin avant de commencer l'activité pour éviter de devoir naviguer ailleurs.\nAvertissement sur les conséquences : Informez les apprenants que toute navigation hors de l'activité ou actualisation de la page mettra fin à l'activité et pourrait affecter leur performance.\nTests préliminaires : Conseillez aux apprenants d'effectuer des tests avec des activités de pratique pour se familiariser avec ces restrictions et vous pouvez vous même effectuer des tests en tant qu'enseignant pour vous assurer que les activités fonctionnent comme prévu.\nEn communiquant efficacement sur ces fonctionnalités et en préparant les apprenants à leur utilisation, on peut minimiser les terminaisons inattendues et assurer une expérience d'apprentissage fluide et sans interruption."}},"/doc/programing/exercise/config":{"title":"Rendre un exercice configurable","data":{"":"La personnalisation des exercices dans PLaTon peut être effectuée par le biais du fichier main.plc (PLaton config), qui définie un ensemble de variables paramétrables.\nCela permet aux utilisateurs, même sans compétences en programmation PLaTon, de configurer et d'ajuster les exercices selon leurs besoins.","processus-de-configuration#Processus de Configuration":"Création de main.plc : Commencez par créer un fichier main.plc dans le répertoire de votre exercice.\nDéfinition des Variables : Définissez une liste de variables avec des attributs spécifiques qui correspondent aux éléments paramétrables de l'exercice.\nLorsque vous créez des variables dans un PLC avec des valeurs par défaut, ces valeurs écraseront les valeurs par\ndéfaut définies dans le fichier main.ple de l'exercice.","processus-dintégration-dans-une-activité#Processus d'Intégration dans une Activité":"Intégration dans une Activité : Lors de l'intégration de l'exercice dans une activité, les variables configurables sont affichées dans un formulaire qui peut être affiché/masqué en cliquant sur les boutons du même nom comme sur l'image ci-dessus.\nPrévisualisation : Il est possible de prévisualiser l'exercice avec les valeurs modifiées afin de s'assurer que les paramètres sont corrects et de les ajuster si nécessaire.\nLorsque l'activité est lancée, les valeurs configurées sont injectées dans l'exercice et peuvent être utilisées dans le code de l'exercice. Cela permet d'avoir une seule ressource de type exercice qui peut être utilisée dans plusieurs activités avec des configurations différentes.Cette méthode évite de dupliquer inutilement du code, simplifiant ainsi la gestion et la mise à jour des exercices. Une autre alternative est de créer un autre exercice complet à partir de ce template en le choisissant au moment de la création d'un exercice.","aperçu-dun-fichier-plc#Aperçu d'un Fichier PLC":"Le fichier main.plc est un template de configuration qui expose des variables pouvant être ajustées lors de l'intégration de l'exercice dans une activité.\nCes variables peuvent remplacer les valeurs par défaut établies dans le fichier main.ple de l'exercice.","interface-de-configuration#Interface de Configuration":"Lorsque vous ouvrez main.plc dans PLaTon, vous êtes accueilli par un formulaire avec les éléments suivants :\nListe des Variables : Un espace à gauche où vous pouvez ajouter, supprimer ou réorganiser les variables configurables de l'exercice.\nOptions de Debug : Un bouton pour vous permettre de visualiser le contenu interne d'un fichier PLC.\nInformations sur les Variables :\nNom : Identifie la variable (ex. min, max).\nType : Spécifie le type de la variable (voir ci-dessous).\nDescription : Un champ pour décrire (en markdown) la variable et énoncer les hypothèses sur sa valeur.\nOptions pour les Variables :\nSelon le type de variable, des options supplémentaires peuvent être disponibles.\nPar exemple, pour les variables de type Nombre, vous pouvez définir une valeur minimale et maximale.","types-de-variables-disponibles#Types de Variables Disponibles":"Nombre : Variables numériques avec ou sans contraintes de limite.\nOptions :\nMin : Valeur minimale autorisée lors de la saisie.\nMax : Valeur maximale autorisée lors de la saisie.\nTexte : Chaînes de caractères.\nCode : Snippets de code qui peuvent être insérés dans l'exercice.\nOptions :\nLangage : Langage de programmation du code.\nBooléen : Valeurs vraies ou fausses.\nFichier : Permet d'intégrer des URL ou du contenu de fichier directement.\nJSON : Structures de données complexes sous forme d'objets JSON.\nExpression Mathématique : Champ de saisie pour récupérer une expression mathématique (le format de sortie est du Latex)\nListe : Permet à l'utilisateur de saisir une liste de valeurs.\nOptions :\nmultiligne : Permet à l'utilisateur de saisir des valeurs sur plusieurs lignes.\nSelect : Permet à l'utilisateur de sélectionner une valeur parmi une liste de valeurs prédéfinies.\nOptions :\nChoix multiple : Permet à l'utilisateur de sélectionner plusieurs valeurs.\nChoix possibles : La liste de valeurs que l'utilisateur peut sélectionner.\nAutomate : Permet à l'utilisateur de dessiner un automate.\nPartout où vous pouvez écrire du texte, vous pouvez utiliser les opérateurs @copyurl et @copycontent pour insérer\ndes URL ou du contenu de fichier directement.","exemple-dutilisation#Exemple d'Utilisation":"Les possibilités offertes par le fichier main.plc dans la création d'exercices PLaTon sont vastes.\nVoici quelques exemples d'utilisation supplémentaires pour illustrer la flexibilité de cet outil.\nPour chaque exemple, nous fournissons un contexte, une configuration main.plc et une application de l'exercice :","exemple-1-exercice-de-mathématiques#Exemple 1: Exercice de Mathématiques":"Contexte :Un professeur souhaite créer une série d'exercices sur les équations du second degré où les élèves doivent trouver les racines.Configuration main.plc :\nVariables pour les coefficients a, b, et c de l'équation ax² + bx + c = 0.\nUn booléen pour activer ou non les aides.\nApplication :\n{\n  \"a\": {\n    \"type\": \"Nombre\",\n    \"min\": -10,\n    \"max\": 10,\n    \"description\": \"Coefficient de x²\"\n  },\n  \"b\": {\n    \"type\": \"Nombre\",\n    \"min\": -10,\n    \"max\": 10,\n    \"description\": \"Coefficient de x\"\n  },\n  \"c\": {\n    \"type\": \"Nombre\",\n    \"min\": -10,\n    \"max\": 10,\n    \"description\": \"Terme constant\"\n  },\n  \"showHints\": {\n    \"type\": \"Booléen\",\n    \"description\": \"Afficher les aides pour la résolution des équations\"\n  }\n}","exemple-2-exercice-de-compréhension-de-texte#Exemple 2: Exercice de Compréhension de Texte":"Contexte :Un exercice où les élèves doivent analyser un texte et répondre à des questions de compréhension.Configuration main.plc :\nUne variable de type Texte pour le passage à lire.\nUne variable de type Fichier pour charger des questions à choix multiples en format JSON.\nApplication :\n{\n  \"texte\": {\n    \"type\": \"Texte\",\n    \"description\": \"Le passage que les élèves doivent lire.\"\n  },\n  \"questions\": {\n    \"type\": \"Fichier\",\n    \"description\": \"Un fichier JSON contenant les questions et options de réponse.\"\n  }\n}","exemple-3-exercice-de-programmation#Exemple 3: Exercice de Programmation":"Contexte :Les élèves doivent écrire un script pour résoudre un problème de programmation spécifique.Configuration main.plc :\nUne variable de type Code pour le squelette de code initial.\nUn booléen pour choisir si le mode débogage est activé.\nApplication :\n{\n  \"skeletonCode\": {\n    \"type\": \"Code\",\n    \"description\": \"Le squelette de code initial que les apprenants doivent compléter.\",\n    \"options\": {\n      \"language\": \"python\"\n    }\n  },\n  \"debugMode\": {\n    \"type\": \"Booléen\",\n    \"description\": \"Activer ou désactiver le mode débogage pour cet exercice.\"\n  }\n}","exemple-4-exercice-de-langues#Exemple 4: Exercice de Langues":"Contexte :Un exercice de langue où les élèves doivent traduire des phrases d'une langue à une autre.Configuration main.plc :\nUne variable de type Texte pour la phrase originale.\nUne variable de type Texte pour la phrase cible attendue.\nApplication :\n{\n  \"sourcePhrase\": {\n    \"type\": \"Texte\",\n    \"description\": \"La phrase à traduire.\"\n  },\n  \"targetPhrase\": {\n    \"type\": \"Texte\",\n    \"description\": \"La traduction attendue de la phrase.\"\n  }\n}\nChaque exemple montre comment main.plc peut être utilisé pour créer des modèles d'exercices flexibles qui peuvent être facilement adaptés et réutilisés pour différents besoins pédagogiques, sans nécessiter que les utilisateurs finaux modifient le code de l'exercice lui-même.\nDans ces exemples, cette documentation affichage le contenu brut des fichiers main.plc pour illustrer les\npossibilités offertes par ce fichier mais dans la pratique, l'édition de ce fichier se fait via un formulaire.","bonnes-pratiques#Bonnes Pratiques":"Clarté des Noms : Nommez les variables de manière intuitive pour que leur fonction soit évidente.\nDescriptions Utiles : Fournissez des descriptions claires pour guider les utilisateurs sur la manière d'utiliser chaque variable.\nValidation des Valeurs : Si possible, définissez des validations dans le code de l'exercice pour vous assurer que les valeurs saisies sont dans les plages attendues.\nEn suivant ces étapes et recommandations, les utilisateurs peuvent créer des exercices PLaTon personnalisables et adaptés à divers scénarios pédagogiques, rendant la plateforme plus accessible et flexible."}},"/doc/programing/exercise/designer":{"title":"Édition graphique d'un exercice","data":{"":"Chaque fichier .ple sur PLaTon peut être modifié de manière visuelle grâce à l'outil d'édition graphique intégré à l'IDE.\nPour accéder à cette fonctionnalité, ouvrez le fichier .ple concerné et cliquez sur l'icône  située dans le coin supérieur droit de l'interface de l'éditeur de texte.","aperçu-de-léditeur-graphique#Aperçu de l'éditeur graphique":"L'éditeur graphique est composé de plusieurs sections pliables :\nTitre : Éditez le titre de votre exercice via un champ de texte simple.\nInstruction : Utilisez un éditeur WYSIWYG pour créer des énoncés enrichis, y compris avec des tableaux.\nFormulaire : Concevez le formulaire de réponse de l'exercice en utilisant également un éditeur WYSIWYG.\nVariables : Gérez les variables de l'exercice — ajoutez, modifiez ou supprimez-les selon vos besoins.\nConstruction : Modifiez le script de construction (builder) de l'exercice.\nÉvaluation : Ajustez le script d'évaluation (grader) de l'exercice.","astuces-et-conseils-dédition#Astuces et Conseils d'Édition":"Vous pouvez insérer des variables dans les champs Titre, Instruction et Formulaire en utilisant la syntaxe de template Nunjucks définie dans la documentation de la syntaxe de PLaTon. Par exemple, {{ macle }} affichera la valeur de la variable macle dans le titre.\nSauvegardez votre travail avec Ctrl + S (ou Cmd + S sur Mac), et pour revenir à l'éditeur de code, sélectionnez  en haut à droite dans l'éditeur graphique.\nL'IDE reformatera automatiquement le fichier .ple tout en préservant les commentaires et les directives spéciales telles que @extends ou @include.","intégration-de-formulaires-externes#Intégration de Formulaires Externes":"Vous avez également la possibilité d'intégrer des formulaires externes en référençant un fichier .plf (PLaTon form) dans une clé du fichier .ple (par exemple form = @copycontent main.plf en supposant que votre PLF s'appel main.plf).\nL'éditeur graphique prendra en charge l'édition de ces formulaires externes de la même manière que ceux intégrés directement dans le mode designer avec la possiblité d'accéder aux variables de l'exercice\navec la syntaxe {{ macle }}.\nVous pouvez créer autant de formulaires externes que vous le souhaitez et les associer à n'importe quelle clé du\nfichier .ple.\nCes outils d'édition graphique facilitent la création et la personnalisation d'exercices sur PLaTon, permettant une conception visuelle intuitive même pour les configurations les plus complexes."}},"/doc/programing/exercise/files":{"title":"Fichiers d'un exercice","data":{"":"En plus d'éventuels fichiers de ressources (images, sons, etc.), un exercice est composé de plusieurs fichiers importants et obligatoires pour certains :\nmain.ple (PLaTon exercice)\nFichier principal contenant le code de l'exercice.\nCe fichier ne peut pas être supprimé.\nmain.plc : (PLaTon config - Optionnel)\nFichier de configuration des variables de l'exercice. Une fois créé, l'exercice sera considéré comme un template et sera donc affiché dans la liste des templates au moment de la création d'un nouvel exercice.\nmain.plo (PLaTon override - Optionnel)\nUniquement créé si l'exercice est issu d'un template. Ce fichier permet de modifier graphiquement les variables configurées dans le template dont est issu l'exercice.\nCe fichier ne peut n'y être créé, n'y supprimé manuellement s'il existe.\nreadme.md\nDocument explicatif de l'exercice, à usage des enseignants.\nLorsque vous créer un exercice, ces fichiers sont automatiquement générés avec un exemple fontionnel de base. Vous pouvez ensuite les modifier à votre guise\net supprimer ceux qui ne vous sont pas utiles."}},"/doc/programing/exercise/langage":{"title":"Le langage ple","data":{"":"La programmation d'un exercice sur la plateforme PLaTon nécessite une compréhension des fondamentaux de sa syntaxe, de la gestion des variables, des opérateurs, et des divers éléments qui composent un exercice interactif.\nCette section fournit un guide détaillé pour démarrer avec la création d'exercices sur PLaTon.","syntaxe#Syntaxe":"Les exercices sont écrits à l'aide du langage ple créé spécialement pour la plateforme. C'est un langage déclaratif simple permettant d'associer des valeurs à des clés.\nLes clés décrivent les éléments primordiaux permettant de mettre en jeu l'exercice de manière interactive devant l'utilisateur.Ainsi, les premières clés caractérisant un exercice sont title dont la valeur donnera un titre à l'exercice ainsi que statement dont le contenu donnera le corps de l'énoncé.\nLa création d'exercice repose donc sur la définition de clés précises qui seront interprétées par la plateforme afin d'afficher l'exercice.Bien qu'il soit possible d'écrire des exercices sans aucune connaissance en informatique, des connaissances en HTML, JavaScript et Python pourront vous permettre de mieux personnaliser vos exercices.Pour illustrer les concepts de base abordés dans cette documentation, nous allons partir d'un exemple simple d'exercice : une addition aléatoire.\n# Choix du sandbox\nsandbox = \"node\"\n# Initialisation des composants\ninput = :wc-input-box\ninput.type = \"number\"\ninput.placeholder = \"Entrez votre réponse ici\"\n# Initialisation des composants de solution\ninputSolution = :wc-input-box\ninputSolution.type = \"number\"\ninputSolution.disabled = true\ninputSolution.placeholder = \"Solution\"\n# Paramètrage des aides\nhint = [\n  @copycontent help.md,\n  \"Aide 2\"\n]\n# Paramètrage des théories\ntheories = [\n  { title: \"Lien vers une ressource externe\", url: \"https://google.com\" },\n  { title: \"Lien vers une ressource interne\", url: @copyurl readme.md }\n]\n# Génération des nombres aléatoires\nmax = 10\nbuilder == #!lang=js\na = Math.round(Math.random() * max)\nb = Math.round(Math.random() * max)\ninputSolution.value = a + b\n==\n# Évaluation de la réponse\ngrader == #!lang=js\ngrade = 0\nfeedback.type = \"error\"\nfeedback.content = \"Mauvaise réponse\"\nif (input.value === inputSolution.value) {\n  grade = 100\n  feedback.type = \"success\"\n  feedback.content = \"Bonne réponse\"\n}\n==\n# Énoncé de l'exercice\ntitle==\nAddition aléatoire\n==\nstatement ==\nCombien font {{a}} + {{b}} ?\n==\nform==\n{{input}}\n==\nsolution==\n{{inputSolution}}\n==","utilisation-des-variables#Utilisation des Variables":"Les variables dans PLaTon peuvent être de différents types et sont utilisées pour stocker des informations ou des éléments d'exercice.","types-de-variables#Types de variables":"Nombres, chaînes de caractères, booléens.\nRéférences, objets, tableaux.\nURL de fichier, contenu de fichier.\nComposants (ex : :wc-input pour un champ de saisie).","affectation-de-variables-#Affectation de Variables :":"L'affectation se fait avec le symbole =.\n# Primitives\nmystring = \"Hello World\"\nmyint = 42\nmyfloat = 3.14\nmynumber_with_underscores = 1_000_000 # Les underscores sont ignorés\nmybool = true # Il est possible d'utiliser la syntaxe python avec True et False\n# Manipulation de fichiers\nmyurl = @copyurl /path/to/file.txt\nmycontent = @copycontent /path/to/file.txt\n# Composants\nmycomponent = :wc-input\n# Références\nmyreference = mystring # Les variables peuvent être référencées entre elles\n# Tableaux\nmyarray = [42, \"Hello World\", true, false, True, @copyurl /path/to/file.txt, @copycontent /path/to/file.txt, :wc-input]\n# Objets\nmyobject = {\n  key1: \"value1\",\n  key2: :wc-input,\n  key3: @copyurl /path/to/file.txt,\n  key4: @copycontent /path/to/file.txt,\n  \"key with space\": \"value with space\"\n}\n# Objects avec notation pointée\nmyobject_dot_notation.key1 = \"value1\"\nmyobject_dot_notation.key2 = :wc-input\nmyobject_dot_notation.key3 = @copyurl /path/to/file.txt\nLes objects et tableaux peuvent être imbriqués à l'infini et contenir des variables de n'importe quel type y compris\nles types nom primitives comme les composants.","opérateurs-#Opérateurs ==":"L'opérateur == permet de saisir des chaînes multilignes brutes (sans échappement).\nmystring ==\nLigne 1\nLigne 2\n==\nCette opérateur est particulièrement utile pour entrer des textes, des scripts Python, des blocs HTML, etc.\nmyscript ==\nlst = []\nfor k in range(5):\n lst.append(k**2)\n==\nIl est possible d'activer une coloration syntaxique dans l'éditeur PLaTon en ajoutant une balise en commentaire après l'opérateur ==.\nDans l'exemple ci-dessous, la balise py active la coloration syntaxique Python pour le code contenu dans la clé myscript.\nmyscript == #lang=py\nlst = []\nfor k in range(5):\n lst.append(k**2)\n==\nPLaTon utilise monaco-editor pour l'édition de code. Il est possible d'activer la coloration syntaxique pour de nombreux langages y compris le language PLaTon avec #!lang=pl-py ou #!lang=pl-js en fonction du type de sandbox.","inclusion-de-fichier-dans-lenvironnement-de-lexercice#Inclusion de Fichier dans l'environnement de l'exercice":"Les exercices sont executés dans un environnement isolé (sandbox). Il est possible d'inclure des fichiers dans cet environnement afin de les lire\npour générer notamment des données aléatoires. Un exemple d'utilisation est l'utilisation d'un fichier csv contenant des données pour générer des questions aléatoires.\nUtilisez @include CHEMIN pour inclure des fichiers dans l'environnement de l'exercice.\nUtilisez @include CHEMIN as NOM pour inclure des fichiers dans l'environnement de l'exercice et les renommer.\nIl est possible de glisser déposer des fichiers depuis l'explorateur de fichier de l'IDE vers la zone dans laquelle\nvous souhaitez inclure le chemin du fichier.","héritage#Héritage":"Hériter d'un fichier .ple consiste à importer son contenu (clés, fichiers à charger). C'est avec l'opérateur @extends qu'on effectue cette opération.\nPermet de réutiliser et étendre le code d'autres exercices.\nUtilisez @extends CHEMIN pour hériter d'un autre exercice.\nExemple. L'exercice associé au fichier main.ple contiendra une clé key1 valant 0 et une clé key2 valant \"toto\".\n@extends parent.ple\nkey1 = 0\nkey1 = 5\nkey2 = \"toto\"\nIl est possible d'hériter en cascade de plusieurs fichiers.","composition#Composition":"La composition est la même chose que l'héritage à la différence que dans le cas d'une composition, on affecte les clés du fichier importé à une variable.\n  mydict = @extends parent.ple\n  mydict.key1 = 0\nkey1 = 5\nSeuls les clés sont stockées dans la variable, pas les fichiers à charger (@include).","les-références-de-fichiers#Les références de fichiers":"Comme vue précédemment, certains opérateurs se servent de fichiers, il est donc important de savoir comment référencer ces fichiers dans les exercices.Il y a quatre manière de référencer un fichier:\nAvec un chemin relatif à l'exercice\nex: readme.md\nAvec un chemin absolue vers un fichier du cercle parent de l'exercice, commençant par /CODE_DU_CERCLE\nex: /informatique/chemin/vers/fichier.ext\nAvec un chemin absolue vers une version particulière d'un fichier du cercle parent de l'exercice, commençant par /CODE_DU_CERCLE:VERSION\nex: /informatique:v1/chemin/vers/fichier.ext\nAinsi, avec une arbre de répertoires comme celui-ci:\nmonexo est la racine de l'exercice\ninformatique est le cercle parent de l'exercice\nplaton est le cercle parent du cercle informatique\n#latest indique qu'on visualise la dernière version du cercle\nIl est possible de référencer base.ple du cercle informatique à l'intérieur de main.ple par :\n/informatique/templates/base.ple\nIl est possible de référencer readme.md de l'exercice monexo à l'intérieur de main.ple par :\nreadme.md\nIl est possible de référencer readme.md du cercle platon à l'intérieur de main.ple par :\n/platon:v1/readme.md\nPar défaut, si une version n'est pas précisée, la dernière version du fichier est utilisée (ex: /platon/readme.md\nutilise /platon:latest/readme.md)."}},"/doc/programing/exercise/hints":{"title":"Affichage d'aides","data":{"":"Les aides (hint) sont un élément crucial dans les exercices PLaTon, offrant un soutien supplémentaire aux apprenants.\nCes aides peuvent être statiques, fournissant des conseils préétablis, ou dynamiques, s'adaptant en fonction des interactions de l'utilisateur.Voici comment vous pouvez les intégrer dans vos exercices.","aides-statiques#Aides Statiques":"Les aides statiques sont des conseils ou des informations prédéfinies qui sont affichés lorsque l'utilisateur demande de l'aide.\nStructure : La clé hint peut contenir un tableau de chaînes de caractères, chaque chaîne représentant une aide distincte.\nExemple :\nhint = [\n  \"Pensez à vérifier vos calculs.\",\n  \"N'oubliez pas que l'ordre des opérations est important.\",\n  @copycontent chemin/vers/fichier.md\n]\nUtilisation : Lorsque l'apprenant clique sur le bouton d'aide, les éléments du tableau hint sont affichés un par un, dans l'ordre.","aides-dynamiques#Aides Dynamiques":"Les aides dynamiques offrent un soutien plus personnalisé, basé sur les actions ou les réponses de l'utilisateur.\nStructure : La clé hint peut être configurée comme un objet contenant les propriétés next, data, et empty.\nnext : Script exécuté dans la sandbox pour vérifier s'il reste des aides à afficher.\ndata : Liste de conseils générés dynamiquement (au format Markdown ou HTML).\ndone : Booléen indiquant si le bouton d'aide doit être affiché (false) ou non (true).\nMise en œuvre :\nDans l'exemple suivant, le script next vérifie si l'utilisateur a cliqué sur le bouton d'aide moins de 5 fois. Si c'est le cas, un nouveau conseil est ajouté à la liste data, et le bouton d'aide est affiché.\nSinon, le bouton d'aide est masqué.\ncount = 0\nhint.data = []\nhint.done = false\nhint.next == #!lang=js\ncount++\nhint.done = count >= 5\nif (count <= 5) {\n  hint.data.push(`Vous avez cliqué **${count}** fois sur le bouton d'aide.`)\n}\n==\nCeci était un exemple simple, mais vous pouvez utiliser des scripts plus complexes pour générer des aides dynamiques.","conseils-pour-la-création-daides-efficaces#Conseils pour la Création d'Aides Efficaces":"Pertinence : Assurez-vous que les aides sont pertinentes pour la tâche et apportent une valeur ajoutée.\nProgressivité : Pour les aides statiques, organisez-les de manière à ce qu'elles deviennent progressivement plus informatives ou spécifiques.\nInteractivité : Pour les aides dynamiques, utilisez les interactions précédentes de l'utilisateur pour offrir des conseils ciblés.\nClarté : Les aides doivent être clairement formulées pour éviter toute confusion supplémentaire.\nL'utilisation efficace des aides dans vos exercices PLaTon peut grandement améliorer l'expérience d'apprentissage, en fournissant un soutien adapté et en encourageant l'autonomie des apprenants."}},"/doc/programing/exercise/theories":{"title":"Intégration de ressources théoriques","data":{"":"La clé theories dans PLaTon permet d'enrichir vos exercices avec des liens vers des ressources théoriques externes ou internes.\nCette fonctionnalité est essentielle pour fournir aux apprenants un contexte supplémentaire, des explications approfondies ou des références.\nVoici comment vous pouvez intégrer efficacement des ressources théoriques dans vos exercices.","structure-de-la-clé-theories#Structure de la Clé theories":"La clé theories est un tableau d'objets, chaque objet représentant une ressource théorique.\nChaque objet contient deux propriétés :\ntitle : Un titre descriptif de la ressource.\nurl : L'URL de la ressource. Cela peut être un lien externe ou un lien interne vers un fichier hébergé sur la plateforme PLaTon.","exemple-dutilisation#Exemple d'Utilisation":"theories = [\n  { title: \"Introduction à la programmation\", url: \"https://example.com/intro-programming\" },\n  { title: \"Documentation sur les boucles\", url: @copyurl /chemin/vers/la/doc/boucles.pdf }\n]\nDans cet exemple, deux ressources théoriques sont ajoutées :\nLa première est un lien externe vers un site web fournissant une introduction à la programmation.\nLa seconde est un lien interne vers une ressource hébergée directement sur PLaTon, comme un fichier Markdown ou PDF.\nLes liens fournis dans la clé theories seront accessibles aux apprenants, via le bouton Théories en bas dans l'interface de l'exercice.\nLorsqu'un apprenant clique sur un lien, il est dirigé vers la ressource correspondante pour des informations supplémentaires dans un nouvel onglet si c'est un lien externe.\nSi le lien est interne, la ressource s'ouvre dans une boite de dialogue au dessus de l'exercice si c'est un fichier Markdown, PDF, image ou vidéo. Sinon le fichier se télécharge directement.","bonnes-pratiques-pour-lutilisation-des-ressources-théoriques#Bonnes Pratiques pour l'Utilisation des Ressources Théoriques":"Pertinence : Assurez-vous que chaque ressource théorique est directement liée au contenu de l'exercice.\nAccessibilité : Vérifiez que les liens externes sont accessibles et que les ressources internes sont bien configurées.\nDiversité des Sources : Incluez une variété de ressources, comme des articles, des tutoriels vidéo, et des documents officiels, pour s'adapter aux différents styles d'apprentissage.\nMises à Jour : Maintenez les liens à jour pour s'assurer que les apprenants accèdent à des informations actuelles et précises.\nTitres Descriptifs : Utilisez des titres clairs et informatifs pour chaque lien afin que les apprenants sachent à quoi s'attendre avant de cliquer.\nL'intégration de ressources théoriques enrichit l'expérience d'apprentissage, en donnant aux apprenants les outils pour comprendre le contexte et les concepts clés de manière plus approfondie. Cette fonctionnalité est particulièrement utile pour créer des exercices plus interactifs et informatifs sur PLaTon."}},"/doc/programing/exercise/metadata":{"title":"Méta-Données d'un Exercice","data":{"":"Durant le cycle de vie d'un exercice, la plateforme va générer des méta-données pour tracer l'activité de l'apprenant et vous fournir des informations sur l'exercice.\nCes méta-données sont utilisables à l'intérieur de toutes les scripts de la sandbox (builder, grader, hint.next etc.) et sont accessibles via la variable meta.","nombre-total-de-tentatives#Nombre total de tentatives":"meta.attemps : Le nombre de fois que l'apprenant a essayé de résoudre l'exercice. Seulement les tentatives valides (grade >= 0) sont comptabilisées. Cette valeur est remise à 0 à chaque fois que l'élève choisit de changer la question.\nmeta.totalAttemps : La somme de toutes les tentatives valides. Cette valeur n'est pas remise à 0 à chaque fois que l'élève choisit de changer la question.","la-liste-des-notes-obtenues#La liste des notes obtenues":"meta.grades : La liste des notes obtenues par l'apprenant de la première à la dernière tentative.\nmeta.grades[0] : La note de la première tentative.\nmeta.grades[meta.grades.length - 1] : La note de la dernière tentative.","savoir-si-des-aides-ont-été-demandées#Savoir si des aides ont été demandées":"meta.consumedHints : Le nombre d'aides demandées par l'apprenant. Cette valeur est remise à 0 à chaque fois que l'élève choisit de changer la question.","savoir-si-la-solution-a-été-affichée#Savoir si la solution a été affichée":"meta.showSolution : Un booléen qui indique si l'apprenant a affiché la solution ou non. Cette valeur est remise à false à chaque fois que l'élève choisit de changer la question.","savoir-si-lexercice-est-la-première-question-de-la-séance#Savoir si l'exercice est la première question de la séance":"meta.isInitialBuild : Un booléen à true au lancement de l'exercice et défini à false à partir du moment où l'apprenant change de question.","cas-dusage#Cas d'usage":"En utilisant ces méta-données, vous pouvez par exemple afficher un message d'encouragement à l'apprenant lorsqu'il réussit l'exercice du premier coup, faire des exercices de plus en plus difficiles en fonctions des dernières notes...\nPour afficher le contenu des métadonnées, vous pouvez utiliser le filtre dump de nunjucks à l'intérieur de l'une des clés d'affichage (form, statement etc.). Par exemple : {{ meta | dump(2) }}\nLes méta-données sont utilisables uniquement en lecture, toute modification de ces données sera ignorée par la\nplateforme."}},"/doc/resources/activities":{"title":"Gestion des activités","data":{"création#Création":"","comment-créer-une-activité-#Comment créer une activité ?":"","étape-1-choix-du-cercle-parent#Étape 1: Choix du Cercle Parent":"Accédez à l'option \"Créer une activité\" dans la barre de menu de PLaTon en cliquant sur le bouton +.\nSélectionnez le cercle parent dans lequel vous souhaitez ajouter votre activité.\nCliquez sur 'Suivant' pour continuer.\nSi vous ouvrez le formulaire de création d'activité à partir de la page d'une ressource, le cercle parent sera\nautomatiquement sélectionné comme étant le cercle dans lequel se trouve la ressource.","étape-2-entrer-les-informations-de-base#Étape 2: Entrer les Informations de Base":"Remplissez le nom de l'activité. Ce nom devrait être descriptif et refléter le contenu de l'activité.\nFournissez une description claire et concise de l'activité pour informer les utilisateurs de son contenu et de son objectif.\nCliquez sur 'Suivant' pour passer à l'étape suivante.","étape-3-associer-des-tags#Étape 3: Associer des Tags":"Décidez si vous voulez associer des tags à votre activité dès maintenant. Les tags facilitent la recherche et la classification des ressources.\nSélectionnez une liste de 'topics' (sujets) et de 'levels' (niveaux) pour classifier votre activité. Cela aidera les autres utilisateurs à trouver l'activité lorsqu'ils recherchent des ressources spécifiques.\nAprès avoir sélectionné les tags appropriés, cliquez sur 'Créer' pour finaliser la création de votre activité.\nVous pouvez toujours ajouter des tags à votre activité plus tard en accédant à la page des paramètres de l'activité.\nEn suivant ces étapes, vous aurez créé un activité dans PLaTon, prêt à être peuplé avec des exercices pour vos étudiants ou collègues.\nRendez-vous dans la documentation sur la programmation des activités pour en savoir plus."}},"/doc/programing/exercise/workflow":{"title":"Construction, Affichage et Évaluation","data":{"":"Le déroulement d'un exercice sous PLaTon se compose de 4 parties:\nLa Construction, à l'aide d'une clé builder\nL'Affichage, à l'aide des clés title, statement, et form\nL'Évaluation, à l'aide d'une clé grader\nLa Solution, à l'aide d'une clé solution","environnment-dexécution--sandbox#Environnment d'exécution : Sandbox":"Les exercices sont executés dans un environnement isolé appelé sandbox. Il existe plusieurs types de sandbox, chacune ayant ses propres caractéristiques.\nLe choix de la sandbox se fait à l'aide de la clé sandbox dans la configuration de l'exercice.","sandbox-node#Sandbox node":"Syntaxe : sandbox = \"node\"\nDescription : Sandbox permettant d'exécuter du code javascript. Cette sandbox est utilisée par défaut et utilise l'api de sandboxing de nodejs.\nLibrairies disponibles : Cette sandbox est pratique pour des exercices simples ne nécessitant pas d'opérations complexes ou de librairies système.\nVous avez accès à l'API de base de javascript ainsi que quelques fonctions utilitaires.","sandbox-python#Sandbox python":"Syntaxe : sandbox = \"python\"\nDescription : Sandbox permettant d'exécuter du code python. Cette sandbox utilise des containers docker pour exécuter du code python.\nLibraries disponibles : Cette sandbox est plus complète que la sandbox node, et vous donne accès à un container Linux avec plusieurs librairies et outils pré-installés (python, gcc, java, postgresql...).\nVous pouvez consulter la liste des librairies disponibles ici\nLa sandbox python n'est pas intégrée par défaut à PLaTon. Pour l'utiliser, vous devez contacter l'équipe de PLaTon ou\nsuivre les instructions de la documentation de la sandbox python.","construction-builder#Construction: Builder":"Afin de construire des exercices ayant une part d'aléatoire, ou de faciliter la création de type d'exercices réutilisables, il peut être nécessaire de passer par un script de construction de l'exercice.Pour cela, il est possible de déclarer un script python/node (en fonction de la sandbox) dans une clé builder.Par exemple :\nbuilder == #!lang=js\nmax = 10\nop1 = Math.round(Math.random() * max)\nop2 = Math.round(Math.random() * max)\n==\nPour utiliser de l'aléatoire sur les sandboxes python, vous devez utiliser la fonction random en l'initialisant avec une graine (seed) automatiquement disponible dans les variables globales du builder.Par exemple:\nimport random\nrandom.seed(seed)","affichage-title-statement-et-form#Affichage: Title, Statement et Form":"Pour afficher un exercice, il est nécessaire de déclarer 3 clés dans la configuration de l'exercice. La valeur de ces clés peut être du HTML et/ou du Markdown.Il est possible d'afficher n'importe quelle variable de l'exercice à l'aide de la syntaxe {{ nomvariable }} dans le contenu de ces 3 clés.\nSi la variable affichée est un texte contenant d'autres affichage de variables, le processus de remplacement des variables s'appliquera récursivement.La plateforme utilise en interne la librairie nunjunks pour le rendu des variables. Il vous est donc possible d'utiliser les fonctionnalités de cette librairie dans vos exercices\ncomme par exemple les filtres ou les expressions.Pour le rendu du markdown, la plateforme utilise la librairie nge-markdown qui contient quelques extensions supplémentaires par rapport au markdown de base comme le support du latex et des onglets.","title#title":"La clé title contient le titre de l'exercice. Par exemple :\ntitle ==\nAddition aléatoire\n==","statement#statement":"La clé statement contient l'énoncé de l'exercice. Par exemple :\ntext ==\nQuel est le **résultat** de: **{{ op1 }}** + **{{ op2 }}** ?\n==\nA l'affichage, après traitement du markdown, du HTML et des variables, en supposant que op1 contient 10 et op2 20, le texte suivant sera affiché:Quel est le résultat de: 10 + 20 ?","form#form":"La clé form contient le formulaire de l'exercice. Par exemple :\ninput = :wc-input-box\ninput.type = \"number\"\ninput.placeholder = \"Entrez votre réponse ici\"\nform ==\n{{ input }}\n==\nLa récupération de la réponse de l'apprenant se fait à l'aide de variables de types composants dont la documentation\nest disponible sur la barre de menu haut.","évaluation-grader#Évaluation: Grader":"Le grader est le script qui va évaluer la réponse de l'apprenant. Il est possible de déclarer un script python/node (en fonction de la sandbox) dans une clé grader.Ce script à accès à l'ensemble des variables de l'exercice: celles déclarées dans le ple, celles créés par le script de construction, celles modifiées par l'apprenant dans le formulaire (les composants).En plus de vos variables, 2 variables spéciales sont disponibles :\ngrade : La note de l'apprenant, entre 0 et 1 (-1 si l'exercice est en erreur)\nfeedback : Un objet permettant de renvoyer un feedback à l'apprenant. Les clés de cet objet sont :\ntype : Le type de feedback à renvoyer à l'apprenant. Les valeurs possibles sont warning, error et success\ncontent : Le message à afficher à l'apprenant (markdown|html)\nVous devez modifier la valeur de ces clés pour renvoyer un feedback à l'apprenant et lui attribuer une note en fonction de sa réponse.Par exemple:\ngrader == #!lang=js\ngrade = 0\nfeedback.type = \"error\"\nfeedback.content = \"Mauvaise réponse\"\n// input.value contient la réponse de l'apprenant\nif (input.value === op1 + op2) {\n  grade = 100\n  feedback.type = \"success\"\n  feedback.content = \"Bonne réponse\"\n}\n// A cet endroit vous pouvez modifer toutes les variables de l'exercice avant de les renvoyer à l'apprenant.\n// Par exemple, vous pouvez afficher la bonne réponse dans input.value\n==\nPar défaut, le type de feedback est un objet, mais il est possible d'afficher plusieurs feedbacks à l'apprenant en\nutilisant un tableau d'objets de feedback. Pour cela, il suffit de déclarer la variable feedback comme un tableau au\ndébut du grader et d'ajouter des objets de feedback à l'intérieur.","affichage-de-la-solution--solution#Affichage de la solution : Solution":"Il est possible d'afficher la solution d'un exercice à l'aide de la clé solution. Cette clé suit la même logique que la clé form, sauf qu'elle contient le HTML/Markdown à afficher à l'apprenant lorsqu'il demande la solution.Par exemple:\ninputSolution = :wc-input-box\ninputSolution.type = \"number\"\ninputSolution.disabled = true\ninputSolution.placeholder = \"Solution\"\nbuilder == #!lang=js\nmax = 10\nop1 = Math.round(Math.random() * max)\nop2 = Math.round(Math.random() * max)\ninputSolution.value = op1 + op2\n==\nsolution ==\n{{ inputSolution }}\n=="}},"/doc/programing/ide":{"title":"L'Environnement de Développement","data":{"":"La conception d'exercices et activité PLaTon se fait dans un environnement de développement intégré (IDE) qui permet de créer, modifier et tester les exercices et activités.Cet environnement est accessible de différentes manières :\nDepuis le bouton Éditer sur les resources de la plateforme\nDepuis la barre d'actions de la page de détails d'une ressource\nDepuis l'onglet Explorer sur la page de détails d'une ressource\nL'IDE est accessible uniquement pour les administrateurs et les enseignants.","présentation-de-lide#Présentation de l'IDE":"L'Environnement de Développement Intégré de PLaTon, est conçu avec l'inspiration du très populaire Visual Studio Code avec la librarie nge-ide. Faisons le tour des fonctionnalités clés qui rendront votre expérience de codage efficace et agréable.","fonctionnalités-clés#Fonctionnalités clés":"","1-la-barre-latérale---votre-hub-de-navigation#1. La Barre Latérale - Votre Hub de Navigation":"Sur le côté gauche, vous trouverez la barre latérale, un hub de navigation polyvalent avec plusieurs sections :\nExplorateur : Votre point d'interaction principal pour tous vos fichiers et projets.\nRecherche : Trouvez rapidement du code, des fichiers ou même un texte spécifique dans vos fichiers.\nLa recherche se limite pour le moment aux fichiers de la ressource courante et non aux cercles parents.\nDocumentation : Accédez aux différentes documentation de PLaTon directement dans l'éditeur pour vous aider dans la création de vos ressources.\nParamètres : Personnalisez votre EDI selon vos préférences, en adaptant l'expérience à votre flux de travail.","2-menu-de-lexplorateur---gestion-de-fichiers-efficace#2. Menu de l'Explorateur - Gestion de Fichiers Efficace":"Dans l'Explorateur, vous avez plusieurs boutons pour rationaliser votre flux de travail :\nModifier les Dossiers Racines : Importez les répertoires des cercles parents de la ressource courante pour n'afficher que ce qui est pertinent pour votre exercice.\nL'éditeur sauvegarde les dossiers racines que vous avez ajoutés et les réaffiche automatiquement lorsque vous\nrevenez à l'éditeur.\nActiver le Filtrage Clavier : Affinez vos recherches et la navigation de fichiers avec des raccourcis clavier.\nActualiser : Mettez à jour votre arborescence de fichiers pour refléter les nouveaux changements ou ajouts.\nTout Plier : Réduisez tous les répertoires pour une vue simplifiée de la structure de votre projet.","3-barre-de-menu-supérieure---le-classique-rencontre-le-moderne#3. Barre de Menu Supérieure - Le Classique Rencontre le Moderne":"En haut, la barre de menu présente des options classiques complétées par une touche moderne :\nBouton de Prévisualisation : Visualisez instantanément votre travail en action, un outil pratique pour le développement web et les fichiers markdown.\nCe bouton est uniquement disponible pour les exercices et activités.","4-zone-dinformation---restez-informé#4. Zone d'Information - Restez Informé":"Le volet inférieur est votre zone d'information, vous tenant informé sur :\nProblèmes : Naviguez rapidement vers les erreurs ou les avertissements dans votre code.\nNotifications : Restez au courant des messages importants en provenace de l'IDE en fonction de vos actions.","5-zone-dédition-centrale---polyvalente-et-puissante#5. Zone d'Édition Centrale - Polyvalente et Puissante":"Le cœur de l'EDI est la zone d'édition centrale, où la polyvalence rencontre la puissance :\nPrise en charge de l'édition et de la visualisation d'une large gamme de fichiers, y compris le code, les PDF, les vidéos et les images.\nLe meilleur moyen de savoir si un fichier est pris en charge est de l'ouvrir et de voir ce qui se passe ! Si l'IDE ne peut pas l'ouvrir, il affichera son contenu brut.\nUne barre d'outils adaptative qui fournit des actions spécifiques au fichier, comme des aperçus améliorés pour les fichiers markdown, HTML, SVG et les fichiers PLaTon.","questions-fréquentes#Questions Fréquentes":"","1-comment-puis-je-ouvrir-plusieurs-fichiers-à-la-fois-#1. Comment puis-je ouvrir plusieurs fichiers à la fois ?":"Lorsque vous ouvrez un fichier, un bouton  vous permet de diviser l'éditeur en deux. Vous pouvez ensuite ouvrir un autre fichier dans la nouvelle zone d'éditeur\naprès avoir cliquer à l'intérieur de la zone d'édition.L'éditeur ouvrira toujours les nouveaux fichiers dans la zone d'édition active et il est possible d'avoir autant de zones d'édition que vous le souhaitez.","2-comment-puis-je-importer-un-dossier-complet-depuis-mon-ordinateur-#2. Comment puis-je importer un dossier complet depuis mon ordinateur ?":"L'éditeur ne prend pas en charge l'importation de dossiers complets depuis votre ordinateur.\nCependant, vous pouvez importer un fichier zip et le décompresser dans l'éditeur en choisissant l'option Extraire ici dans le menu contextuel.","3-pourquoi-je-ne-peux-pas-éditer-certains-fichiers-#3. Pourquoi je ne peux pas éditer certains fichiers ?":"Dans certains cas, l'éditeur affiche le contenu de vos fichier en lecture seule. Cela se produit notamment dans les cas suivants :\nVous n'avez pas les droits d'édition sur la ressource car vous n'êtes pas collaborateur sur le cercle de la ressource.\nVous êtes entrain de visualiser une version antérieure de la ressource. Seul la dernière version est éditable.\nSelon votre type de ressouce, certains fichiers spécifques ne peuvant pas être éditées, suppression ou renommés.\nPour les exercices et activités, les fichiers main.ple et main.pla ne peuvent pas être supprimés car c'est le point d'entrée.\nPour les exercies issues de templates, vous ne pouvez pas éditer le contenu du main.ple car il est généré automatiquement. L'édition se fait en ouvrant le fichier main.plo qui vous permet de l'éditer graphiquement.","4-insertion-de-fichiers-par-glisser-déposer#4. Insertion de Fichiers par Glisser-Déposer":"Enrichissez votre code en glissant et déposant des fichiers directement dans votre éditeur.\nIl vous proposera une liste de choix pour insérer du code pertinent à l'emplacement du dépôt.Cette documentation ne fait qu'effleurer la surface de ce qui est possible. Plongez, explorez et personnalisez l'IDE pour qu'il corresponde à votre style de programmation. Bon codage !"}},"/doc/programing/vscode":{"title":"Utiliser Visual Studio Code comme Éditeur","data":{"":"Cette page est en cours de rédaction."}},"/doc/resources/circles":{"title":"Gestion des cercles","data":{"fonctionnalités-clés#Fonctionnalités Clés":"Organisation et Héritage :\nLes cercles opèrent dans une structure hiérarchique où il peut y avoir des sous-cercles. Chaque cercle peut hériter des propriétés et des ressources d'un cercle parent, avec PLaTon étant le cercle le plus élevé. Cette structure d'héritage permet une organisation et une gestion efficaces des ressources éducatives à différents niveaux.\nCercle Principal - PLaTon :\nPLaTon agit comme le cercle racine ou principal. En tant que tel, il constitue la base de l'organisation des ressources et des activités sur la plateforme, fournissant un cadre global pour les sous-cercles.\nCercle Personnel :\nChaque utilisateur a un cercle personnel qui lui est propre. Ce cercle est utilisé pour stocker les ressources personnelles de l'utilisateur, telles que les brouillons et les ressources en cours de développement\net n'est visible que par l'utilisateur lui-même sauf s'il décide de partager le cercle avec d'autres utilisateurs.\nGestion des Collaborateurs :\nLes cercles sont tous visibles à la consultation, mais seuls les administrateurs et les utilisateurs définis comme \"collaborateurs\" peuvent modifier les informations des cercles et y créer des activités et exercices. Cela permet aux administrateurs de contrôler les modifications apportées aux cercles et de s'assurer que les ressources sont correctement gérées.\nFlexibilité dans la Création de Sous-Cercles : Les administrateurs peuvent créer des sous-cercles pour des besoins spécifiques, tels que des projets de groupe, des départements spécifiques, ou des initiatives de recherche.","création#Création":"","comment-créer-un-cercle-#Comment créer un cercle ?":"","étape-1-choix-du-cercle-parent#Étape 1: Choix du Cercle Parent":"Accédez à l'option \"Créer un cercle\" dans la barre de menu de PLaTon en cliquant sur le bouton +.\nSélectionnez le cercle parent dans lequel vous souhaitez ajouter votre nouveau cercle.\nCliquez sur 'Suivant' pour continuer.\nSi vous ouvrez le formulaire de création de cercle à partir de la page d'une ressource, le cercle parent sera\nautomatiquement sélectionné comme étant le cercle dans lequel se trouve la ressource.","étape-2-entrer-les-informations-de-base#Étape 2: Entrer les Informations de Base":"Remplissez le nom du cercle. Ce nom devrait être descriptif et refléter la thématique ou le groupe d'utilisateurs auquel le cercle est destiné.\nEntrez un code unique pour le cercle. Ce code sert d'identifiant unique et non modifiable. Il sera utilisé pour faire référence aux fichiers du cercle depuis une autre ressource.\nFournissez une description claire et concise du cercle pour informer les utilisateurs de son contenu et de son objectif.\nCliquez sur 'Suivant' pour passer à l'étape suivante.","étape-3-associer-des-tags#Étape 3: Associer des Tags":"Décidez si vous voulez associer des tags à votre cercle dès maintenant. Les tags facilitent la recherche et la classification des ressources.\nSélectionnez une liste de 'topics' (sujets) et de 'levels' (niveaux) pour classifier votre cercle. Cela aidera les autres utilisateurs à trouver le cercle lorsqu'ils recherchent des ressources spécifiques.\nAprès avoir sélectionné les tags appropriés, cliquez sur 'Créer' pour finaliser la création de votre cercle.\nVous pouvez toujours ajouter des tags à votre cercle plus tard en accédant à la page des paramètres du cercle.\nEn suivant ces étapes, vous aurez créé un cercle dans PLaTon, prêt à être peuplé avec des activités et des exercices pour vos étudiants ou collègues.\nN'oubliez pas que la gestion efficace des cercles est cruciale pour une organisation et une navigation optimales des ressources pédagogiques sur la plateforme.","vue-densemble#Vue d'Ensemble":"La page \"Vue d'ensemble\" dans PLaTon offre aux utilisateurs un aperçu rapide et intuitif de l'état actuel et de la structure d'un cercle donné.\nElle présente des informations clés et des statistiques qui aident à comprendre la dynamique et l'utilisation des ressources au sein du cercle.","suivi-de-létat-des-ressources#Suivi de l'État des Ressources":"Cette section centrale affiche un diagramme circulaire coloré qui représente la distribution des différents états des ressources du cercle (sous-cercles, activités et exercices):\nPrêt à l'Utilisation : Indique le pourcentage de ressources qui sont complètes et disponibles pour être utilisées immédiatement dans les cours.\nContient des bugs : Représente les ressources qui ont été signalées pour contenir des erreurs et nécessitent une attention.\nBesoin d'être testé : Ressources qui ont été créées ou modifiées et qui attendent une vérification ou un test d'efficacité.\nBrouillon : Une grande partie des ressources peut être en phase de brouillon, indiquant qu'elles sont en cours de développement et ne sont pas encore prêtes pour la publication.\nChaque état est cliquable et redirige vers la page de recherche avec les ressources correspondantes.À droite du diagramme, on trouve des indicateurs numériques clés qui offrent un accès rapide aux différentes catégories de ressources et utilisateurs associés au cercle :\nObservateurs : Le nombre d'utilisateurs qui suivent le cercle pour recevoir des notifications sur les mises à jour.\nCollaborateurs : Les utilisateurs actuellement impliqués dans la création ou la révision des ressources du cercle.\nCercles Enfants : Indique le nombre de sous-cercles reliés au cercle actuel.\nActivités : Le nombre total d'activités liées à ce cercle.\nExercices : Une quantité d'exercices spécifiés qui sont associés au cercle.","tags#Tags":"La section des tags souligne l'importance de classer efficacement les ressources à l'aide de topics (sujets) et de levels (niveaux) pour une organisation et une recherche optimisées.\nElle contient un bouton \"Ajouter des tags\" qui facilite l'attribution de tags aux ressources pour augmenter leur visibilité et accessibilité."}},"/doc/resources/exercises":{"title":"Gestion des exercices","data":{"comment-créer-une-activité-#Comment créer une activité ?":"","étape-1--choix-du-cercle-parent#Étape 1 : Choix du Cercle Parent":"Accédez à l'option \"Créer un exercice\" dans la barre de menu de PLaTon en cliquant sur le bouton +.\nSélectionnez le cercle parent dans lequel vous souhaitez ajouter votre exercice.\nCliquez sur 'Suivant' pour continuer.\nSi vous ouvrez le formulaire de création d'exercice à partir de la page d'une ressource, le cercle parent sera\nautomatiquement sélectionné comme étant le cercle dans lequel se trouve la ressource.","étape-2--entrer-les-informations-de-base#Étape 2 : Entrer les Informations de Base":"Remplissez le nom de l'exercice. Ce nom devrait être descriptif et refléter le contenu de l'exercice.\nFournissez une description claire et concise de l'exercice pour informer les utilisateurs de son contenu et de son objectif.\nCliquez sur 'Suivant' pour passer à l'étape suivante.","étape-3--associer-des-tags#Étape 3 : Associer des Tags":"Décidez si vous voulez associer des tags à votre exercice dès maintenant. Les tags facilitent la recherche et la classification des ressources.\nSélectionnez une liste de 'topics' (sujets) et de 'levels' (niveaux) pour classifier votre exercice. Cela aidera les autres utilisateurs à trouver le cercle lorsqu'ils recherchent des ressources spécifiques.\nAprès avoir sélectionné les tags appropriés, cliquez sur 'Créer' pour finaliser la création de votre exercice.\nVous pouvez toujours ajouter des tags à votre exercice plus tard en accédant à la page des paramètres du exercice.","étape-4--choix-du-mode-dédition#Étape 4 : Choix du mode d'édition":"Choisissez la manière dont vous souhaitez créer votre exercice entre :\nPartir d'un template : vous pouvez choisir un template d'exercice existant et le modifier selon vos besoins de manière graphique et intuitive sans avoir à écrire de code.\nPartir de zéro : vous pouvez créer votre exercice à partir de zéro en écrivant directement le code de l'exercice dans l'environnement de développement intégré de PLaTon.\nSi vous choisissez de créer à partir de zéro, vous pouvez créer l'exercice à cette étape en cliquant sur 'Créer' pour terminer le processus de création.\nSinon, cliquez sur 'Suivant' pour passer à l'étape suivante et choisir un template.","étape-5--choix-dun-template#Étape 5 : Choix d'un template":"Cette étape n'est disponible que si vous avez choisi de créer votre exercice à partir d'un template.\nIci, vous pouvez choisir un template d'exercice existant et le modifier selon vos besoins de manière graphique et intuitive sans avoir à écrire de code.\nLes templates sont des exercices pré-construits disponibles dans l'un des cercles parent de l'exercice.\nVous souhaitez créer un template d'exercice ? Rendez-vous dans la documentation sur la création de templates\nd'exercice.\nEn suivant ces étapes, vous aurez créé un exercice dans PLaTon, prêt à être programmé.\nRendez-vous dans la documentation sur la programmation des exercices pour en savoir plus."}},"/doc/resources/events":{"title":"Événements","data":{"":"Cette page est en cours de rédaction."}},"/doc/resources/explorer":{"title":"Gestion des Fichiers et Versionnement","data":{"fonctionnalité-de-gestion-des-fichiers#Fonctionnalité de Gestion des Fichiers":"Dans PLaTon, chaque ressource, qu'elle soit un cercle, une activité ou un exercice, peut être contenir divers fichiers.\nCette fonctionnalité permet aux utilisateurs d'ajouter une richesse multimédia et documentaire à leur contenu éducatif\nmais plus important pour les activités et exercices de programmer ces derniers comme expliqué sur le chapitre sur les guides de programmation.","ajout-et-accessibilité-des-fichiers#Ajout et Accessibilité des Fichiers":"Types de Fichiers :\nIl n'y a aucune restriction sur le type de fichiers que vous pouvez associer à une ressource. Que ce soit des documents textuels, des images, des vidéos, des feuilles de calcul ou des archives, tous peuvent être intégrés.\nPropriété des Fichiers :\nLes fichiers sont propres à la ressource à laquelle ils sont ajoutés. Ils deviennent une partie intégrante de celle-ci, enrichissant le matériel d'apprentissage.","versionnement-des-fichiers#Versionnement des Fichiers":"Qu'est-ce que le Versionnement ?\nLe versionnement est un système qui enregistre les changements apportés aux fichiers au fil du temps. Cela vous permet de revenir à une version antérieure si nécessaire et de suivre l'évolution du contenu.\nUtilité :\nCe système est particulièrement utile pour les collaborations, car il permet à plusieurs utilisateurs de travailler sur les mêmes fichiers sans risque de perte de données.","héritage-et-utilisation-des-fichiers#Héritage et Utilisation des Fichiers":"Partage au sein des Cercles :\nLes fichiers ajoutés à un cercle sont accessibles à tous les sous-cercles, activités et exercices qui en découlent. Cela assure une cohérence et une disponibilité des ressources à travers la structure hiérarchique de PLaTon.\nExemple d'Utilisation :\nUn fichier ajouté dans un cercle \"Mathématiques\" sera accessible pour une activité \"Algèbre\" dans ce même cercle, ainsi que pour tous les exercices relatifs à cette activité.","gestion-des-fichiers-via-lide#Gestion des Fichiers via l'IDE":"IDE de PLaTon :\nL'IDE, ou environnement de développement intégré, est une interface au sein de PLaTon où vous pouvez éditer, supprimer ou ajouter de nouveaux fichiers à vos ressources.\nPrévisualisation :\nL'IDE vous permet de prévisualiser certains types de fichiers, tels que les images, les vidéos ou les documents textuels, directement dans l'interface.\nPour les fichiers programmées, vous pouvez les exécuter directement dans l'IDE pour certains (.md, .svg, .html, .ple etc.) en cliquant sur le bouton Prévisualiser en haut à droite de l'IDE.\nÉdition et Suppression :\nDans l'IDE, vous pouvez mettre à jour les fichiers existants ou en supprimer si nécessaire.\nL'IDE gère automatiquement le traçage des modifications à chaque sauvegarde.\nAjout de Fichiers :\nPour ajouter de nouveaux fichiers, utilisez simplement les outils de téléchargement ou de création de fichiers dans l'IDE en faisant un clique droit sur le dossier dans lequel vous souhaitez ajouter le fichier ou en utilisant le menu Fichier/Importer en haut à gauche de l'IDE.\nNote : Il est possible d'importer un dossier entier en important une archive .zip puis en sélectionnant Extraire ici après avoir fait un clique droit sur l'archive dans l'IDE.\nVous trouverez une explication plus détaillée sur l'utilisation de l'environnement de développment sur cette\npage.","gestion-des-fichiers-via-lexplorateur-de-fichiers#Gestion des fichiers via L'Explorateur de Fichiers":"Explorateur de Fichiers :\nL'Explorateur de Fichiers est une interface qui vous permet de gérer les fichiers de vos ressources en dehors de l'IDE depuis la page de la ressource.\nActions réalisables : Certaines actions sont réalisables depuis la barre d'outils de l'Explorateur de Fichiers, comme :\nImport de Fichiers : Vous pouvez importer des fichiers depuis votre ordinateur en cliquant sur le bouton Importer sur la barre d'outils en haut de l'Explorateur de Fichiers ou en faisant un clique droit sur le dossier dans lequel vous souhaitez ajouter le fichier.\nTéléchargement : Vous pouvez télécharger les fichiers et dossiers en faisant un clique droit sur le fichier ou le dossier puis en sélectionnant Télécharger ou en cliquant sur le bouton Télécharger de la barre d'outils pour télécharger le dossier entier.\nNouvelle version : Vous pouvez versionner l'état actuel de la ressource en cliquant sur le bouton Nouvelle version de la barre d'outils.\nPrévisualiser : Si la ressource est une activité ou un exercice, vous pouvez directement lancez la prévisualisation de la ressource en cliquant sur le bouton Prévisualiser de la barre d'outils."}},"/doc/resources/members":{"title":"Collaboration dans les Cercles","data":{"accès-et-permissions#Accès et Permissions":"Dans PLaTon, bien que tous les cercles soient visibles pour consultation par les utilisateurs de la plateforme,\nseuls les collaborateurs et les administrateurs d'un cercle donné ont la capacité de modifier les informations du cercle ou de publier des ressources en son sein.\nCela garantit que la gestion des contenus est réalisée par des utilisateurs autorisés, maintenant ainsi l'intégrité et la qualité des ressources éducatives.","devenir-collaborateur-dun-cercle#Devenir Collaborateur d'un Cercle":"Il existe deux méthodes pour obtenir le statut de collaborateur dans un cercle :","1-invitation-par-un-administrateur#1. Invitation par un Administrateur":"","processus-dinvitation#Processus d'Invitation":"Un administrateur du cercle accède à la page des collaborateurs, où il peut voir la liste des membres actuels et inviter de nouveaux collaborateurs.\nPour envoyer une invitation, l'administrateur entre le nom ou l'e-mail de l'utilisateur et sélectionne 'Inviter'.\nUne fois l'invitation envoyée, l'administrateur peut voir la liste des invitations en attente, avec la possibilité de les annuler.","réception-et-gestion-des-invitations#Réception et Gestion des Invitations":"L'utilisateur invité reçoit une notification, laquelle contient des boutons 'Accepter' ou 'Refuser', lui permettant de choisir de rejoindre le cercle en tant que collaborateur ou de décliner l'invitation.","2-demande-dadhésion-personnelle#2. Demande d'Adhésion Personnelle":"","faire-une-demande#Faire une Demande":"Un utilisateur souhaitant devenir collaborateur d'un cercle peut initier une demande en naviguant sur la page du cercle et en cliquant sur le bouton 'Demander à rejoindre' situé dans la barre des actions.\nUne fois la demande soumise, l'utilisateur peut l'annuler à tout moment en cliquant sur le bouton 'Annuler la demande de rejoindre' situé dans la barre des actions.","notification-et-approbation-des-demandes#Notification et Approbation des Demandes":"Une fois la demande soumise, les administrateurs du cercle reçoivent une notification. Ils peuvent alors consulter la demande dans la page des collaborateurs et décider de l'accepter ou de la refuser.\nLes demandes approuvées permettent à l'utilisateur de devenir collaborateur, avec la possibilité de modifier les informations du cercle et de contribuer au contenu.","rôles-et-responsabilités#Rôles et Responsabilités":"En tant que collaborateur, un utilisateur acquiert des responsabilités supplémentaires au sein du cercle, telles que la maintenance du contenu et l'interaction avec les autres membres.\nLes administrateurs, quant à eux, gardent une vue d'ensemble et un contrôle sur la gestion des collaborateurs, s'assurant que le cercle reste un espace productif et conforme à ses objectifs pédagogiques."}},"/doc/resources/permissions":{"title":"Gestion des droits","data":{"qui-peut-voir-une-ressource-#Qui peut voir une ressource ?":"Tous les enseignants et administrateurs peuvent voir les ressources sans restriction sauf si la ressource est dans un cercle personnel ou est un cercle personnel.\nIl est possible de rendre visible les cercles personnels à des utilisateurs spécifiques. Pour cela, il faut ajouter\nles utilisateurs dans la liste des collaborateurs du cercle.","qui-peut-créer-un-cercle-#Qui peut créer un cercle ?":"Seuls les administrateurs peuvent créer des cercles.","qui-peut-créeréditer-des-activités-et-exercices-#Qui peut créer/éditer des activités et exercices ?":"Seuls les administrateurs et les utilisateurs définis comme \"collaborateurs\" peuvent créer des activités et exercices.","qui-peut-modifier-les-informations-dune-ressource-#Qui peut modifier les informations d'une ressource ?":"Seuls les administrateurs et les utilisateurs définis comme \"collaborateurs\" peuvent modifier les informations d'une ressource."}},"/doc/resources/types":{"title":"Types de ressource","data":{"introduction#Introduction":"Avant de détailler les différents types de ressources disponibles sur PLaTon, il est essentiel de comprendre ce que nous entendons par \"ressource\" dans le cadre de PLaTon.","définition-dune-ressource-platon#Définition d'une Ressource PLaTon":"Qu'est-ce qu'une Ressource ?\nDans PLaTon, une ressource est définie comme un conteneur pour tout élément ou contenu pédagogique utilisé pour faciliter l'enseignement et l'apprentissage. Cela peut inclure des documents textuels, des vidéos, des exercices interactifs, des présentations, des ensembles de données, des quiz, et bien plus encore.\nLes ressources sont les composants clés qui alimentent le processus éducatif sur la plateforme.\nObjectif des Ressources :\nLes ressources sont conçues pour offrir une expérience d'apprentissage enrichissante, en aidant les enseignants à transmettre des connaissances et les apprenants à acquérir des compétences et des informations de manière efficace et engageante tout en récoltant des données sur la pertinence et l'efficacité des ressources.\nAprès avoir établi ce qu'est une ressource, explorons les types spécifiques de ressources que PLaTon offre : les cercles, les activités et les exercices, ainsi que la façon dont ces éléments interagissent pour créer un environnement d'apprentissage structuré et intégré.","les-cercles#Les Cercles":"","icône#Icône":"group_work","définition-et-usage#Définition et Usage":"Un cercle dans PLaTon est une entité organisationnelle qui regroupe diverses ressources et utilisateurs autour d'un thème, d'un sujet ou d'un objectif commun. Il peut s'agir d'une matière spécifique, d'un projet de recherche, ou d'une communauté d'enseignement.","les-activités#Les Activités":"","icône-1#Icône":"widgets","définition-et-usage-1#Définition et Usage":"Une activité est une tâche ou un ensemble de tâches conçues pour engager les apprenants dans un processus d'apprentissage.","intégration-dans-les-cercles#Intégration dans les Cercles":"Les activités sont associées à des cercles spécifiques, permettant une organisation thématique et une navigation simplifiée.","les-exercices#Les Exercices":"","icône-2#Icône":"article","définition-et-usage-2#Définition et Usage":"Un exercice est une tâche spécifique, souvent autocorrigée, conçue pour tester ou renforcer les compétences et connaissances des apprenants dans un domaine particulier.","intégration-dans-les-activités#Intégration dans les Activités":"Les exercices peuvent être incorporés dans les activités pour fournir une expérience d'apprentissage pratique et interactive."}},"/doc/resources/watchers":{"title":"Observateurs","data":{"":"Bien que toutes les ressources soient accessibles sur la plateforme, il est nécessaire de pouvoir choisir lesquelles suivre afin de rester informé des dernières modifications\net de pouvoir les retrouver plus facilement. Pour cela, PLaTon propose un système d'observateurs.","devenir-observateur#Devenir observateur":"Pour devenir observateur d'une ressource, il suffit de cliquer sur le bouton \"Suivre\" présent sur la page de la ressource.\nUne fois observateur, il est possible de se désabonner en cliquant sur le bouton \"Ne plus suivre\" présent sur la page de la ressource.\nLorsqu'on créé une ressource, on devient automatiquement observateur de celle-ci.","avantages#Avantages":"Pour un exercice, suivre l'exercice permet de l'ajouter à des activités.\nPour une activité, suivre l'activité permet de l'ajouter à des cours.\nDes notifications sont envoyées en cas de changement important (changement de status, ajout d'activités et exercices, etc.)\nSeules les ressources suivies sont ajoutables dans les cours et activités pour des raisons de performances."}},"/doc/resources/search":{"title":"Recherche de ressources","data":{"":"Cette page est en cours de rédaction."}},"/doc/users/account-types":{"title":"Types de Comptes","data":{"types-de-comptes#Types de Comptes":"Dans PLaTon, différents types de comptes sont disponibles, chacun offrant des niveaux d'accès et des fonctionnalités spécifiques. Ces types de comptes déterminent les actions que les utilisateurs peuvent effectuer sur la plateforme. Voici une description détaillée de chaque type de compte et de leurs capacités respectives.","compte-administrateur-système#Compte Administrateur Système":"Les administrateurs système ont le niveau d'accès le plus élevé sur PLaTon. Ils sont responsables de la gestion globale de la plateforme au sein de leur établissement.Actions Possibles :\nGestion des Utilisateurs : Création, modification et désactivation des comptes utilisateurs.\nConfiguration de la Plateforme : Réglage des paramètres globaux de PLaTon, comme les options de sécurité, les intégrations LTI et la maintenance.\nSurveillance et Rapports : Accès à des outils analytiques pour surveiller l'utilisation de la plateforme et générer des rapports détaillés.\nGestion des Ressources : Capacité de visualiser, éditer ou supprimer toutes les ressources créées par les utilisateurs.","compte-enseignant#Compte Enseignant":"Les comptes enseignants sont conçus pour ceux qui développent et gèrent le contenu éducatif et les cours sur PLaTon.Actions Possibles :\nCréation de Cours et d'Activités : Développement et organisation de cours, de leçons et d'exercices interactifs.\nGestion des Inscriptions : Inscription des étudiants dans leurs cours et attribution des correcteurs.\nSuivi des Performances : Accès à des outils pour suivre et évaluer les progrès des étudiants.\nPartage de Ressources : Partage de matériel pédagogique avec d'autres enseignants ou étudiants.","compte-étudiant#Compte Étudiant":"Les comptes étudiants sont destinés aux apprenants utilisant PLaTon pour leur formation.Actions Possibles :\nAccès aux Cours : Participation aux cours et activités proposés sur la plateforme.\nSoumission de Travaux : Envoi de devoirs et participation à des exercices interactifs.\nConsultation des Résultats : Visualisation des retours sur leurs travaux et suivi de leur progression.\nInteraction et Collaboration : Utilisation des forums de discussion et des outils de collaboration pour interagir avec les enseignants et les autres étudiants.","compte-invité#Compte Invité":"Le \"compte invité\" dans PLaTon n'est pas un compte à proprement parler, dans le sens traditionnel des systèmes de gestion d'utilisateurs. Au lieu de cela, il s'agit d'une désignation spécifique pour les utilisateurs qui accèdent à des ressources partagées publiquement en dehors de la plateforme PLaTon, comme des exercices de démonstration ou du contenu éducatif ouvert.Caractéristiques Principales :\nAccès Sans Enregistrement : Les utilisateurs désignés comme \"invités\" peuvent accéder à certaines ressources sans nécessiter de compte ou d'enregistrement sur PLaTon.\nUtilisation Limitée : Leur interaction avec la plateforme est limitée à la visualisation ou à la participation à des activités spécifiquement partagées pour un usage public.\nAucune Sauvegarde en Base : Contrairement aux autres types de comptes, les informations des utilisateurs invités ne sont pas sauvegardées dans la base de données de PLaTon. Leur accès est temporaire et spécifique aux ressources auxquelles ils ont accès.\nIdéal pour la Démonstration : Ce type d'accès est particulièrement utile pour présenter des fonctionnalités de PLaTon à des non-utilisateurs, comme lors de démonstrations ou de présentations publiques.","note-importante-sur-la-cumulativité-des-actions-par-rôle#Note Importante sur la Cumulativité des Actions par Rôle":"Il est essentiel de noter que dans PLaTon, les actions permises par les différents rôles sont cumulatives. Cela signifie que chaque rôle supérieur intègre les capacités et les permissions des rôles situés en dessous de lui dans la hiérarchie. Par exemple :\nEnseignants : En plus de leurs propres fonctions spécifiques, comme la création de cours et la gestion des inscriptions, les enseignants peuvent effectuer toutes les actions qu'un étudiant peut réaliser. Cela inclut l'accès aux cours, la participation aux activités, et la soumission des travaux.\nAdministrateurs : Les administrateurs, ayant le niveau d'accès le plus élevé, peuvent réaliser non seulement leurs tâches administratives, mais aussi toutes les actions accessibles aux enseignants et aux étudiants. Cela comprend la création de contenu, la gestion des cours, et la participation aux activités éducatives.\nCette structure de permissions assure que les utilisateurs peuvent effectuer toutes les tâches pertinentes à leur rôle, tout en conservant un accès aux fonctionnalités essentielles des rôles inférieurs, garantissant ainsi une flexibilité et une efficacité optimales dans l'utilisation de la plateforme PLaTon."}},"/doc/users/groups":{"title":"Gestion des Groupes Utilisateurs","data":{"":"La gestion des groupes utilisateurs est une fonctionnalité clé pour les administrateurs sur PLaTon.\nElle permet de regrouper les utilisateurs selon divers critères et besoins, tels que des classes, des groupes de travaux pratiques, ou des équipes d'enseignants.\nCe chapitre aborde la création, la modification et la gestion des membres des groupes, ainsi que les différents cas d'utilisation.","création-et-modification-de-groupes#Création et Modification de Groupes":"","création-de-groupe#Création de Groupe":"Ajout d'un Nouveau Groupe : Les administrateurs peuvent créer de nouveaux groupes en spécifiant des informations telles que le nom du groupe, sa description, et son objectif.\nParamètres du Groupe : Il est possible de définir des paramètres spécifiques pour chaque groupe, comme des règles d'accès ou des rôles spéciaux au sein du groupe.","modification-de-groupe#Modification de Groupe":"Édition des Informations : Les administrateurs peuvent modifier les informations d'un groupe à tout moment, y compris son nom, sa description et ses paramètres.\nSuppression de Groupe : Un groupe peut être supprimé si nécessaire. Cette action doit être effectuée avec prudence car elle peut affecter l'accès des utilisateurs aux ressources liées au groupe.","gestion-des-membres-du-groupe#Gestion des Membres du Groupe":"","ajout-et-suppression-de-membres#Ajout et Suppression de Membres":"Assignation des Membres : Les administrateurs peuvent ajouter des utilisateurs aux groupes, soit individuellement, soit en masse.\nRetrait de Membres : De même, les membres peuvent être retirés d'un groupe si leur participation n'est plus nécessaire ou appropriée.","cas-dutilisation-des-groupes#Cas d'Utilisation des Groupes":"","exemples-pratiques#Exemples Pratiques":"Classes : Création de groupes pour des classes spécifiques, facilitant la gestion des cours et des ressources pour un ensemble d'étudiants.\nGroupes de Travaux Pratiques : Formation de petits groupes pour des sessions de travaux pratiques ou des projets de groupe.\nGroupe d'Enseignants : Regroupement des enseignants par département ou par matière pour faciliter la collaboration et le partage de ressources.\nCorrecteurs : Création de groupes de correcteurs pour des évaluations ou des examens, permettant une répartition efficace des tâches de correction.","interface-de-gestion-des-groupes#Interface de Gestion des Groupes":"","conception-et-fonctionnalités#Conception et Fonctionnalités":"Interface Intuitive : L'interface de gestion des groupes est conçue pour être facile à utiliser, permettant une gestion rapide et efficace des groupes et de leurs membres.\nVisibilité et Contrôle : Les administrateurs ont une vue complète sur tous les groupes existants sur la plateforme et peuvent gérer ces groupes de manière centralisée.\nLa gestion des groupes utilisateurs est un outil puissant dans PLaTon, offrant aux administrateurs la flexibilité nécessaire pour organiser les utilisateurs de manière efficace et logique. Que ce soit pour des besoins académiques, administratifs ou de collaboration, cette fonctionnalité facilite la gestion et l'optimisation de l'expérience utilisateur sur la plateforme."}},"/doc/users/lti-integration":{"title":"Intégration LTI","data":{"explication-du-fonctionnement-de-lti-learning-tools-interoperability#Explication du Fonctionnement de LTI (Learning Tools Interoperability)":"Learning Tools Interoperability (LTI) est une norme développée par l'IMS Global Learning Consortium.\nElle permet l'intégration transparente de divers outils d'apprentissage et de contenus dans des systèmes de gestion de l'apprentissage (LMS).\nLTI facilite la communication entre les plateformes d'apprentissage et les outils externes, permettant aux utilisateurs de bénéficier d'une expérience d'apprentissage unifiée sans avoir à se connecter séparément à chaque outil.","platon-en-tant-quoutil-lti#PLaTon en tant qu'Outil LTI":"PLaTon est conçu comme un outil LTI, ce qui signifie qu'il peut s'intégrer facilement dans n'importe quel LMS compatible LTI, comme Moodle, Canvas ou Blackboard.\nCette intégration permet aux enseignants et aux étudiants d'accéder à PLaTon directement à partir de leur LMS habituel, en utilisant leurs identifiants existants.","ajouter-un-lms-à-platon#Ajouter un LMS à PLaTon":"Pour intégrer un LMS avec PLaTon, vous devez fournir les informations suivantes dans l'espace d'administration des LMS :\nNom : Nommez votre intégration LMS pour la distinguer facilement dans PLaTon.\nURL : L'adresse URL du LMS avec lequel vous souhaitez intégrer PLaTon.\nURL de résultat : Cette URL est utilisée par PLaTon pour renvoyer les informations au LMS, telles que les scores ou les progrès des étudiants.\nClé : Une clé unique fournie par le LMS pour authentifier l'intégration.\nSecret : Un secret partagé entre PLaTon et le LMS, utilisé en conjonction avec la clé pour sécuriser la communication.\nCes informations permettent une communication sécurisée entre PLaTon et le LMS, garantissant que les données des utilisateurs sont protégées et que l'interaction entre les deux systèmes est fluide.","se-connecter-à-platon-depuis-un-lms--exemple-avec-moodle#Se Connecter à PLaTon depuis un LMS : Exemple avec Moodle":"Pour vous connecter à PLaTon depuis Moodle :","configuration-dans-moodle-#Configuration dans Moodle :":"Allez dans la section de gestion des plugins ou modules complémentaires de Moodle.\nAjoutez un nouvel outil externe en spécifiant l'URL de PLaTon (https://platon.example.com/api/v1/lti/launch), la clé et le secret fournis.\nPour plus de détails sur la configuration de l'outil externe dans Moodle, consultez la documentation Moodle :","utilisation-par-les-enseignants-et-les-étudiants-#Utilisation par les Enseignants et les Étudiants :":"Une fois configuré par un adminstrateur Moodle, les enseignants peuvent ajouter l'outil externe à leurs cours Moodle en suivant les instructions ici.\nDéfinissez Preconfigured tool sur Automatic, based on launch URL et entrez https://platon.example.com/api/v1/lti/launch?next=PAGE_URL dans le champ Tool URL (en remplaçant PAGE_URL par l'URL de la page de destination dans PLaTon).\nLorsque les enseignants et les étudiants cliquent sur le lien de l'outil externe dans leur cours Moodle, ils sont automatiquement redirigés et connectés à PLaTon, les emmenant directement à la page spécifiée après next=.\nSi la page cible est un cours, ils seront inscrits automatiquement dans le cours sur PLaTon.\nLes cours dans PLaTon intègrent un bouton partage qui permet aux enseignants de générer un lien direct vers la page de\ndestination dans PLaTon. Ce lien peut être utilisé pour configurer l'outil externe dans Moodle."}},"/doc/users/lti-roles":{"title":"Assignation des Rôles via LTI","data":{"":"Dans PLaTon, l'assignation des rôles des utilisateurs est fortement influencée par les paramètres de la requête LTI (Learning Tools Interoperability).\nLorsqu'un utilisateur se connecte à PLaTon via un LMS (Learning Management System) utilisant LTI, son rôle dans PLaTon est déterminé par les rôles LTI qui lui sont attribués dans le LMS.\nVoici comment ces rôles sont mappés dans PLaTon :","assignation-des-rôles-lti#Assignation des Rôles LTI":"PLaTon utilise les rôles LTI pour attribuer des rôles spécifiques aux utilisateurs en fonction de leur fonction dans le système éducatif.\nCes rôles LTI sont classés en quatre grandes catégories : AdminRoles, InstructorRoles, StudentRoles et ReviewerRoles.","1-adminroles#1. AdminRoles":"Ces rôles sont attribués aux utilisateurs ayant des responsabilités administratives dans le LMS. Les utilisateurs avec ces rôles dans le LMS seront généralement assignés à des rôles administratifs dans PLaTon, leur permettant de gérer la plateforme, les comptes utilisateurs et les configurations systèmes.","2-instructorroles#2. InstructorRoles":"Les utilisateurs avec des rôles d'instructeur dans le LMS sont considérés comme des enseignants ou des créateurs de contenu dans PLaTon. Ils ont la capacité de créer des cours, des exercices, de gérer les inscriptions des étudiants et de suivre leurs progrès.","3-studentroles#3. StudentRoles":"Les rôles d'étudiants dans le LMS correspondent à des comptes étudiants dans PLaTon. Ces utilisateurs ont accès aux cours, peuvent soumettre des travaux, participer à des activités et accéder à leur matériel éducatif.","4-reviewerroles#4. ReviewerRoles":"Ces rôles incluent des fonctions de soutien et de mentorat comme les tuteurs, les mentors, ou les assistants d'enseignement. Dans PLaTon, ils sont considérés comme des étudiants, mais vous pouvez leur donner des rôles de correcteurs dans les cours auxquels ils sont inscrits pour mieux refléter leurs responsabilités si nécessaire.\nTout utilisateur PLaTon peut être assigné en tant que correcteur dans un cours à condition qu'il soit inscrit à ce\ncours.","exemple-dassignation-de-rôle#Exemple d'Assignation de Rôle":"Lorsqu'un utilisateur se connecte à PLaTon via une requête LTI depuis un LMS, les rôles LTI qui lui sont attribués dans le LMS sont transmis dans la requête.\nPLaTon utilise ces informations pour déterminer le rôle approprié pour l'utilisateur sur la plateforme.\nPar exemple, si un utilisateur se connecte avec le rôle LTI urn:lti:instrole:ims/lis/Instructor, PLaTon l'identifiera comme un enseignant, lui donnant accès aux fonctionnalités associées à ce rôle.Cette méthode d'assignation des rôles assure que les utilisateurs ont le niveau d'accès et les fonctionnalités appropriés dans PLaTon, reflétant leur rôle et leurs responsabilités dans leur environnement éducatif.\nCette intégration étroite entre les rôles LTI et PLaTon permet une gestion efficace des utilisateurs et une expérience utilisateur cohérente entre le LMS et la plateforme PLaTon."}},"/doc/users/profile":{"title":"Gestion des Profils Utilisateurs","data":{"":"Ce chapitre détaille les actions réalisables par les administrateurs dans la section dédiée à la gestion des profils utilisateurs sur PLaTon.\nCette gestion est cruciale pour maintenir l'ordre et l'efficacité au sein de la plateforme, en permettant aux administrateurs de contrôler l'accès et les rôles des utilisateurs.","liste-des-utilisateurs#Liste des Utilisateurs":"","fonctionnalités-de-la-liste#Fonctionnalités de la Liste":"Affichage et Tri : Les utilisateurs sont listés dans une table facilement navigable. Les administrateurs peuvent trier cette liste par différents critères tels que le nom, ou la date de création du compte en cliquant sur les en-têtes de colonne.\nFiltres Avancés : Des filtres sont disponibles pour affiner la recherche d'utilisateurs selon leur rôle (enseignant, étudiant, administrateur, etc.) ou leur statut. Cela permet une gestion plus rapide et plus précise.","gestion-de-lactivité-des-utilisateurs#Gestion de l'Activité des Utilisateurs":"","actions-sur-les-comptes-utilisateurs#Actions sur les Comptes Utilisateurs":"Désactivation d'un Utilisateur : Cette action bloque l'accès à l'application pour l'utilisateur concerné. Un utilisateur désactivé ne pourra plus se connecter ni accéder à ses cours ou ressources jusqu'à ce que son compte soit réactivé.\nActivation d'un Utilisateur : Si un compte a été désactivé, cette action permet de rétablir l'accès de l'utilisateur à l'application. Une fois activé, l'utilisateur récupère ses accès et peut reprendre ses activités normalement sur la plateforme.","modification-des-rôles-utilisateurs#Modification des Rôles Utilisateurs":"","changement-de-rôle#Changement de Rôle":"Changer le Rôle d'un Utilisateur : Les administrateurs ont la capacité de modifier le rôle d'un utilisateur (par exemple, de passer un étudiant à enseignant ou vice versa). Ce changement peut être nécessaire pour refléter l'évolution du statut de l'utilisateur dans l'établissement ou pour corriger des attributions de rôles initiales.","interface-administrateur#Interface Administrateur":"Conception et Accessibilité\nInterface Conviviale : L'interface de gestion des profils est conçue pour être intuitive et facile à utiliser, permettant aux administrateurs de gérer efficacement les comptes sans difficulté technique.\nAccès Sécurisé : Seuls les utilisateurs ayant des privilèges administratifs peuvent accéder à cette section, garantissant la sécurité et la confidentialité des informations des utilisateurs.\nEn résumé, la gestion des profils utilisateurs dans PLaTon donne aux administrateurs le pouvoir de superviser efficacement\nles comptes utilisateurs, en assurant que l'accès à la plateforme est accordé de manière appropriée et que les rôles des utilisateurs sont correctement attribués.\nCette gestion joue un rôle crucial dans le maintien de l'ordre et de la sécurité sur la plateforme."}},"/doc/resources/tags":{"title":"Tags et Classification","data":{"":"Cette page est en cours de rédaction."}},"/":{"title":"Introduction","data":{"présentation-de-platon#Présentation de PLaTon":"PLaTon est un projet universitaire open source conçu pour enrichir l'expérience pédagogique des enseignants et des apprenants.\nLa plateforme ne se limite pas à la création d'exercices, elle ambitionne également de fournir des conseils, de monitorer les apprentissages et d'assister à la cohérence des activités pédagogiques.\nPLaTon se positionne comme un outil d'apprentissage polyvalent, à la fois pour les enseignants, dans leur rôle de planificateurs et rédacteurs d'activités pédagogiques, et pour les apprenants.","objectif-et-vision#Objectif et vision":"PLaTon est né de la nécessité d'un outil open source flexible et adaptatif, répondant aux besoins spécifiques de notre communauté éducative. Nos objectifs principaux sont :\nEncourager la réutilisabilité des ressources pédagogiques.\nIntégrer et rendre interopérables une multitude de ressources.\nFaciliter l'adoption et l'adaptation de nos ressources par d'autres.\nOffrir des ressources pédagogiques libres, gratuites et de qualité.\nPromouvoir la correction, la validation et la curation des ressources de manière collaborative et par les pairs.\nGarantir la liberté de publication pour permettre à tous de contribuer.\nCréer un environnement propice à la collaboration productive.\nProposer des ressources adaptées à différents niveaux de compétence linguistique.\nRespecter scrupuleusement le RGPD, ainsi que l'éthique et la déontologie des métiers de l'enseignement.","public-cible-et-utilisateurs#Public cible et utilisateurs":"PLaTon est destiné principalement aux enseignants et aux étudiants dans le secteur de l'éducation.\nLes enseignants peuvent l'utiliser pour créer des exercices interactifs, planifier des cours et évaluer les performances des étudiants,\ntandis que les étudiants bénéficient d'une plateforme d'apprentissage interactif pour renforcer leurs compétences et connaissances.","structure-de-la-documentation#Structure de la documentation":"Cette documentation est structurée de manière à fournir une compréhension claire et détaillée de toutes les facettes de PLaTon.\nElle est divisée en plusieurs chapitres, chacun abordant des aspects spécifiques de la plateforme, depuis son utilisation générale jusqu'aux fonctionnalités avancées.","comment-utiliser-cette-documentation#Comment utiliser cette documentation":"La documentation est conçue pour être intuitive et facile à naviguer.\nLes utilisateurs peuvent se référer à des sections spécifiques pour obtenir des informations détaillées sur des fonctionnalités particulières\nou parcourir la documentation dans son intégralité pour une compréhension globale de la plateforme.","licences#Licences":"Le cœur de PLaTon est publié sous la licence CeCILL-B, une licence franco-française similaire en termes de flexibilité aux licences BSD.\nNous encourageons la création de ressources sous la licence CC-By-SA 3.0, reconnue internationalement comme une norme pour les œuvres culturelles libres, afin de favoriser le partage et la collaboration au sein de la communauté éducative."}},"/showcase":{"title":"Cette page est en cours de construction","data":{}}}